const { Telegraf } = require('telegraf');
const Table = require('cli-table3');
const { getUserSettings, updateUserSettings, getUserSettingsString, getAllUsers, getBannedUsers, banUser, unbanUser, addAdmin, removeAdmin, getAdmins, deleteUser, deleteAllUsers, banCheck } = require('./db'); // Предполагаем, что эти функции реализованы в db.js
const { getServerListQ2, queryServerQ2 } = require('./quake2');
const { getServerListQW, queryServerQW } = require('./qw');
const config = require('./config');

const bot = new Telegraf(config.TELEGRAM_TOKEN);
const ownerId = config.OWNER_ID; // ID владельца бота
const userTimers = {};
const userContexts = {}; // Сохраняем контексты пользователей
const messageIds = {}; // Объект для хранения ID сообщений по игровым серверам
const heuristicHistoryScores = {}; // Массив для эвристики
const heuristicHistoryMaps = {}; // Массив для эвристики
const heuristicHistoryPlayers = {}; // Массив для эвристики
const heuristicHistoryPlayersScores = {}; // Массив для эвристики

// 🔁 Глобальный кэш данных по серверам (в памяти бота)
const globalServerCache = {
  q2: {},   // key: "ip:port" → { serverInfo, serverPlayers, lastUpdated, game, ip, port }
  qw: {}
};

// Таймер глобального опроса серверов
let globalServerTimer = null;
let isGlobalServerCacheRefreshing = false; // 👈 защита от наложений

let botName;
let botId;
bot.telegram.getMe().then(botInfo => {
  botName = botInfo.username;
  botId = botInfo.id;
});

//поглядеть https://github.com/kraloveckey/getids-bot/blob/main/treeify.js
//поглядеть https://habr.com/ru/articles/778620/

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function CheckBan(user) {
  //banned
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// определяем куда добавлён бот
function getKind(ctx) {
  try {
    let kind;
    if (ctx.chat.type === 'private') {
      kind = 'private';
    } else if (ctx.chat.type === 'supergroup' || ctx.chat.type === 'group') {
      kind = ctx.chat.type;
    } else {
      kind = ctx.chat.type;
    }
    log('kind=', kind);
    return kind;
  } catch (error) {
    console.error('Ошибка:', error);
    return 'error';
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function getUserID(ctx) {
  const kind = getKind(ctx);
  let userId;

  if (kind === 'private') {
    userId = ctx.from.id;
  } else if (kind === 'supergroup' || kind === 'group') {
    // Проверка на наличие темы
    const message = ctx.callbackQuery ? ctx.callbackQuery.message : ctx.message;
    const themeId = message.message_thread_id;
    userId = themeId ? ctx.chat.id * themeId : ctx.chat.id;
    if (themeId) updateUserSettings(userId, { themeId: themeId });
  } else {
    userId = ctx.chat.id; // Для каналов и других типов чатов
  }
  // log('getUserID. kind=' + kind + ', userId=' + userId + ', ctx.chat.id=' + ctx.chat.id + ', message_thread_id=' + message.message_thread_id);



  return userId;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.start(async (ctx) => {
  try {
    const welcomeMessage = `
🎮 *Добро пожаловать в Quake2InfoBot!*

🤖 *@${botName}* - продвинутый бот для мониторинга игроков, серверов и карт на серверах.
В   Поддерживаемые игры: ${config.GAMES_SUPPORT}, в будущем планируется интеграция с прочими играми в серии Quake.

*Описание:*
Бот позволяет мониторить игроков на серверах, анализируя все доступные для бота сервера, получаемые из внешних источников.
Кроме того, вы можете мониторить отдельные серверы и вести собственный список серверов.
Вы также можете использовать бота для поиска карт, которые вас интересуют и использовать их как фильтры для автоматического поиска.
Наконец, вы можете задавать такие параметры, как минимальное значение игроков на сервере, а также включать фильтрацию ботов типа WallFly для того, чтобы поиск был наиболее эффективен.

✨ *Как быстро начать пользоваться ботом:*
 1) Введите команду /siq2 или /siqw для быстрого поиска информации по активным серверам (таким, на которых имеется не менее одного игрока)
 2) Введите команду /sq2 или /sqw для получения статистики по игровым серверам
 3) Введитие команду /fq2 <текст для поиска> или /fqw <текст для поиска> для того, чтобы найти что либо. Например, /fq2 playground
 4) Введите команду /addgame <название игры> или /ag, чтобы добавить игру в список поддерживаемых ботом. Названия игр, которые вам доступны: ${config.GAMES}
 5) Включите расширенный GUI в результатах поиска командой /ac 1
 6) Включите отображение информации по игрокам командой /am 1
 7) Попробуйте поискать информацию по серверам командой /ssq2 для q2 или /ssqw для qw , а также по картам командой /smq2 \\*dm\\* \\*rdm\\* \\*duel\\* для q2 или /smqw \\*dm\\* для QuakeWord
 8) Попробуйте добавить интересующий вас сервер в мониторинг через кнопки GUI в найденных ботом серверах или через команды /asq2 или /asqw
 9) Включите таймер командой /timer или /t, например /t 30
 10) Попробуйте поискать игрока командой /sp , например /sp \\*para\\* или /sp \\*player\\*
 11) Попробуйте добавить игрока в мониторинг через GUI в найденных ботом игроках или командой /ap
 12) Запустите вручную обновление по добавленным вами игрокам командой /rp и серверам командой /rs
 13) Включите команду /adh 1 для автоматического удаления предыдущих сообщений о найденных игроках / серверах
 14) Включите команду /hm 1 для базового эвристического контроля обновлений игроков и серверов в мониторинге (будут анализироваться только изменения игроков и счета на сервере)

📌 /info - выдаёт ваши текущие настройки. 
      /i - сокращённое наименование команды

📜 *Полный список команд:*
- Для получения информации о всех доступных командах, введите /help.

🕵️ Используйте команду /addplayer <имя игрока> или /ap, чтобы добавить игроков в список мониторинга.
🕵️ Используйте команду /addplayerfilter <имя игрока> или /apf, чтобы добавить игроков в список фильтрации мониторинга.
🖥️🕵️ Используйте команду /aspf <address:port> <имя игрока>, чтобы добавить в фильтр пару сервер - игрок

🖥️ Используйте команду /addserverq2 <address:port> или /asq2, чтобы добавить сервер Quake 2 в список мониторинга.
🖥️ Используйте команду /addserverqw <address:port> или /asqw, чтобы добавить сервер QuakeWorld в список мониторинга.
- Используйте команду /addmapq2 <название карты> или /amq2, чтобы добавить карту Q2 в список мониторинга
- Используйте команду /addmapqw <название карты> или /amqw, чтобы добавить карту QuakeWorld в список мониторинга
🈁 Используйте команду /advcontrols или /ac для того, чтобы включить или выключить сервсисные кнопки в результатах поиска для вашего удобства управления
- Используйте команду /advmode или /am для того, чтобы установить режимы отображения информации в найденных результатах поиска (включить / выключить детальную информацию о сервере и игроках)
- Используйте команду /altview или /av для того, чтобы установить альтернативный (компактный) режим отображения информации
- Используйте команду /heuristicmode или /hm для того, чтобы установить эвристический анализ изменения информации в мониторинге
- Используйте команду /minplayers или /mp для того, чтобы установить минимальное кол-во игроков на сервере и сервер был включён в результат поиска (по умолчанию = 1)
- Используйте команду /minplayerscore или /mp для того, чтобы установить минимальное кол-во очков игрока на сервере для того, чтобы игрок был включён в результат поиска (по умолчанию = 0)

🔍 Запускайте поиск / обновление данных командами /refresh, /rp, /rs.
🕓 Установите интервал опроса с помощью команды /timer <секунды> если вы хотите, чтобы бот автоматически сканировал сервера по вашим параметрам.
📚 Установите /advmode в случае, если вы хотите получать расширенную информацию с серверов

🔍 Для разового поиска воспользуйтесь командами:
    - /sp - она ищет игроков по всем вашим играм сразу
    - /siq2, /ssq2 и /smq2 - поиск серверов и карт в Quake2
    - /siqw, /ssqw и /smqw - поиск серверов и карт в QuakeWorld
    - /fq2, /fqw = поиск произвольной инфы
    - /stats, /sq2 и /sqw - просмотр статистики
    - /sq2m и /sqwm - мониторинг статистики серверов. 

📜 *Полный список команд:*
- Для получения информации о всех доступных командах, введите /help.

💡Идея, разработка и поддержка бота: ly (@QuakeJourney).
Квейк видео: @QuakeVideos, @QuakeChampionsVideos.

🎮 Поддерживаемые ботом игры: *${config.GAMES_SUPPORT}*

Версия бота: *${config.VERSION}*

`;

    const chunks = welcomeMessage.match(/(.|[\n\r]){1,4096}/g);
    for (const chunk of chunks) {
      // console.log(chunk);
      try {
        await ctx.reply(chunk, { parse_mode: 'Markdown' });
      }
      catch (error) {
        console.log(`Ошибка рассылки уведомлений: `, error);
      }
    }
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    // Проверяем настройки пользователя и запускаем автообновление, если timer установлен
    const userSettings = await getUserSettings(userId);

    if (ctx.message.message_thread_id) updateUserSettings(userId, { themeId: ctx.message.message_thread_id });

    if (userSettings && userSettings.timer > 0 && userSettings.timerEnabled == 1) {
      await startAutoSearch(userId, userSettings.timer);
    }
  } catch (error) { console.log(`Ошибка: `, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Инициализируем автообновления при запуске бота
//initializeAutoServersUpdate();
console.log('Запуск глобального автоматического опроса серверов...');
startGlobalServerPolling();    // 🔁 новый глобальный опрос серверов и заполнение кэша в памяти
console.log('Запуск автоматического обновения поиска по данным пользователей...');
initializeAutoSearch(); // Инициализация автообновлений

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*
bot.on('message', (msg) => {
  const text = msg.text;
  const isCommand = false;

  bot.hears(text.replace('/',''), (ctx) => {
    console.log('Команда /helpadmin зарегистрирована!');
    isCommand = true;
  });

  if (!isCommand) {
    // Обработка сообщения, не являющегося командой
    log('Пользователь написал:', text);
    bot.telegram.sendMessage(msg.chat.id, 'Я не понимаю то, что вы написали 🦊.\nСписок поддерживаемых команд: 📜 /help');
  }
});
*/
/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function helpAdmin(ctx) {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    console.log('ctx.chat.type=', ctx.chat.type);
    const info = `
🤖 *@${botName}* - бот для мониторинга игроков на серверах.
    Поддерживаемые игры: ${config.GAMES_SUPPORT}, в будущем планируется интеграция с прочими играми в серии Quake.

🔍 *Описание:*
Бот позволяет мониторить игроков на серверах, анализируя все доступные для бота сервера, получаемые из внешних источников либо ведомые пользователями бота.

📋 *Команды:*

- /help - основные команды

📋 *Административные команды:*

- /users - информация о пользователях бота

- /user <userId> - расширенная информация о пользователе бота с таким Telegram ID

- /deluser <userId> - удаляет пользователя из пользователей бота (с очищением его настроек), команда доступна только для владельца бота.

- delallusers - удаляет всех пользователей бота (с очищением их настроек), команда доступна только для владельца бота.

- /ban <userId> - банит пользователя бота с таким Telegram ID

- /unban <userId> - разбанивает пользователя бота с таким Telegram ID

- /banlist - показывает список банов

- /addadm <userId> - делает админом пользователя бота (доступ ко всем административным командам, кроме /deluser и /delallusers)

- /deladm <userID> - удаляет пользователя из администраторов бота

- /admlist - показывет список админов бота

- /setbotfilter - настраивает фильтр против ботов типа WallFly так, чтобы они не мешали условиям поиска /minplayers или /mp.

💡 Идея, разработка и поддержка бота: ly (@QuakeJourney).
Квейк видео: @QuakeVideos, @QuakeChampionsVideos.

🎮 Поддерживаемые ботом игры: *${config.GAMES_SUPPORT}*

Версия бота: *${config.VERSION}*
`;

    ctx.reply(info, { parse_mode: 'Markdown' });
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('helpadmin', async (ctx) => {
  try {
    await helpAdmin(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
}
);

bot.command('ha', async (ctx) => {
  try {
    await helpAdmin(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
}
);

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function help(ctx) {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    const info = `
🤖 *@${botName}* - продвинутый бот для мониторинга игроков, серверов и карт на серверах.
    Поддерживаемые игры: ${config.GAMES_SUPPORT}, в будущем планируется интеграция с прочими играми в серии Quake.

🔍 *Описание:*
Бот позволяет автоматически мониторить игроков, сервера и игровые карты на серверах.
Кроме того, вы можете мониторить отдельные серверы и вести собственный список серверов (например, для игры Quake II по умолчанию бот получает сервера с сайта q2server.com).
Вы также можете использовать бота для поиска карт, которые вас интересуют и использовать их как фильтры для автоматического поиска.
Наконец, вы можете задавать такие параметры, как минимальное значение игроков на сервере, а также включать фильтрацию ботов типа WallFly для того, чтобы поиск был наиболее эффективен.

✨ *Как быстро начать пользоваться ботом:*
 1) Введите команду /siq2 или /siqw для быстрого поиска информации по активным серверам (таким, на которых имеется не менее одного игрока)
 2) Введите команду /sq2 или /sqw для получения статистики по игровым серверам
 3) Введитие команду /fq2 <текст для поиска> или /fqw <текст для поиска> для того, чтобы найти что либо. Например, /fq2 playground
 4) Введите команду /addgame <название игры> или /ag, чтобы добавить игру в список поддерживаемых ботом. Названия игр, которые вам доступны: ${config.GAMES}
 5) Включите расширенный GUI в результатах поиска командой /ac 1
 6) Включите отображение информации по игрокам командой /am 1
 7) Попробуйте поискать информацию по серверам командой /ssq2 для q2 или /ssqw для qw , а также по картам командой /smq2 \\*dm\\* \\*rdm\\* \\*duel\\* для q2 или /smqw \\*dm\\* для QuakeWord
 8) Попробуйте добавить интересующий вас сервер в мониторинг через кнопки GUI в найденных ботом серверах или через команды /asq2 или /asqw
 9) Включите таймер командой /timer или /t, например /t 30
 10) Попробуйте поискать игрока командой /sp , например /sp \\*para\\* или /sp \\*player\\*
 11) Попробуйте добавить игрока в мониторинг через GUI в найденных ботом игроках или командой /ap
 12) Включите команду /hm 1 для базового эвристического контроля обновлений игроков и серверов в мониторинге (будут анализироваться только изменения игроков и счета на сервере)

📋 *Команды:*

📌 /start - стартовое окно бота

📌 /help - справочное руководство по командам (регулярно обновляется)
      /h - сокращённое наименование команды.
      
📌 /addgame <название игры) - добавляет игру в поддержку работы ботом. Доступные игры: ${config.GAMES}
      Например, /addgame qw добавляет игру QuakeWorld
      /ag - сокращённое наименование команды.

🕵️ /addplayer <название игрока> - добавляет игрока в список мониторинга ботом. 
      Например, /addplayer \\*David\\* (обрамление текста звездочками) найдет всех игроков, в имени которых встречаются подстрока David либо david либо daVid и т.д.
      /ap = сокрашённое наименование команды.
  💡ВАЖНО: Если вы хотите искать игроков, в имени которых имеются пробелы, обрамляйте имя кавычками, например, /addplayer "\\*Q u a d\\*" и /addplayer "Q u a d e r" - с такими значениями вы сможете найти затем игрока с ником Q u a D e R. 
  💡Минимальное количество символа(ов) при указании имени игрока без маски: ${config.PLAYERS_NICK_NAME_LIMIT}.
  💡Минимальное количество символа(ов) при указании имени игрока с маской: ${config.PLAYERS_NICK_NAME_MASK_LIMIT}.
  💡Максимальное количество игроков, которые вы можете добавить: ${config.PLAYERS_COUNT_LIMIT}.
  💡Вы можете добавлять сразу несколько игроков, разделяя их пробелами - например: /addplayer *David* *purri* *syanid*

🕵️ /addplayerfilter <название игрока> - добавляет игрока в список исключения мониторинга ботом.
  💡Возможности и требования такие же как для команды /addplayer.
      /apf = сокращённое наименование команды.

🖥️🕵️ /aspf <IPAddress:Port либо Domen:Port> <название игрока> - добавляет пару сервер - игрок в список исключения мониторинга ботом.
  💡Возможности и требования для указания сервера такие же как для команды /addserverq2 и /addserverqw.
  💡Возможности и требования для названия игрока такие же как для команды /addplayer.

🖥️ /addserverq2 <IPAddress:Port либо Domen:Port> либо /addserverqw для QW - добавляет сервер в список мониторинга ботом. Например, /addserverq2 q2.playground.ru:27910
  💡Максимальное количество серверов, которые вы можете добавить: ${config.SERVERS_COUNT_LIMIT}.
  💡Вы можете добавлять сразу несколько серверов, разделяя их пробелами - например: /addserverq2 q2.playground.ru:27910 104.15.247.5:27910
      /asq2 и /asqw - сокращённое наименование команды.

📌 /addmapq2 <название карты> для Q2 либо /addmapqw для QW - добавляет игровую карту в список мониторинга ботом.
  💡Возможности и требования к формату названия карты такие же как для имен игроков в команде /addplayer.
      /amq2 либо /amqw - сокращённое наименование команды.

🕵️ /delplayer <название игрока> - удаляет игрока из списка мониторинга ботом. Например, если ранее заводили \\*David\\*, то нужно писать /delplayer \\*David\\*, а если заводили "\\*Q u a d*\\*", то надо и писать /delplayer "\\*Q u a d*\\*"
      /dp - сокращённое наименование команды.

🕵️ /delplayerfilter <название игрока> - удаляет  игрока из списка исключения мониторинга ботом.
  💡Возможности и требования такие же как для команды /delplayer.
      /dpf = сокращённое наименование команды.

🖥️ /delserverq2 <IPAddress:Port для Q2 либо Domen:Port> либо /delserverqw для QW - удаляет сервер из списка мониторинга ботом 
     /dsq2 либо /dsqw - сокращённое наименование команды.

📌 /delmapq2 <IPAddress:Port для Q2 либо Domen:Port> либо /delmapqw для QW - удаляет карту из списка мониторинга ботом 
     /dmq2 либо /dmqw - сокращённое наименование команды.

📌 delall - удаляет все настройки поиска. Примечание: команда удаляет настройки без дополнительных предупреждений. 
  ⚠️Для удаления только всех игроков используйте команду delallp, фильтра игроков - команду delallpf,  серверов - команду delalls, карт - команду delallm (поставьте символ / перед названием команды).

🕵️ /minplayers - задаёт минимальное кол-во игроков на сервере для того, чтобы сервер был включён в результат поиска (по умолчанию = 1)
      /mp - сокращённое наименование команды

🕵️ /minplayerscore - задаёт минимальное кол-во очков игрока на сервере для того, чтобы игрок был включён в результат поиска на сервере (по умолчанию = 0)
      /mps - сокращённое наименование команды      

📌 /botfilter - включает встроенный фильтр ботов серверов типа "игроков" с именем WallFly[BZZZ] так, чтобы они не влияли на /minplayers. По умолчанию фильтр включён.
  💡Для примера, если вы зададите /minplayers 1 и включите фильтр ботов командой /botfilter 1, то такие сервера не включатся в поиск в случае если на них есть только один игрок с именем WallFly[BZZZ] когда вы будете искать сервера по игровым картам командой /smq2.
      /bf - сокращённое наименование команды

📌 /info - выдаёт ваши текущие настройки. 
      /i - сокращённое наименование команды

🕓 /timer <секунды> - интервал запуска мониторинга наличия игроков на серверах. При /timer 0 отключает автоматическое обновление. Важно: не задавайте слишком маленькие значения, это может увеличить нагрузку на мониторинг и засыпать вас спам-сообщениями. Рекомендуемое значение - от 60 секунд и более. Например, /timer 600 - автоматическое обновление 1 раз в 600 секунд (т.е., 10 минут).
  💡Минимальное значение: ${config.MIN_TIMER} секунд(ы).
      /t - сокращённое наименование команды

📌 /sleeptime <время начала-время конца> - интервал для сна, во время которого бот не производит мониторинг игроков на серверах. Например, /sleeptime 23:00-11:00.
      /st - сокращённое наименование команды

📌 /refresh - принудительный запуск мониторинга на основе ваших настроек - игроков на серверов, независимо от настроек /timer и /sleeptime.
      /r - сокращённое наименование команды

📌 /rp - принудительный запуск поиска игроков, которые заданы в ваших настройках, независимо от настроек /timer и /sleeptime.

📌 /rs - принудительный запуск апдейта информации с серверов, которые заданы в ваших настройках, независимо от настроек /timerи /sleeptime.

📚 /advmode - отображение расширенной информации в сообщении с найденным на сервере игроком (0 - отключено, 1 - отображение только дополнительной информации о текущем счете и других игроках, 2 - отображение только дополнительной информации о параметрах сервера, 3 - отображение всей дополнительной информации).
      /am - сокращённое наименование команды

🈁 /advcontrols - включает дополнительные кнопки в результатах поиска игроков (0 - отключено, 1 - включено).
      /ac - сокращённое наименование команды

📌 /altview - включает альтернативный (компактный) режим отображения информации (0 - отключено, 1 - включено).
      /av - сокращённое наименование команды

📌 /autodelhistory - включает автоматическое удаление предыдущих сообщений о найденных игроках / серверах (0 - отключено, 1 - включено).
      /adh - сокращённое наименование команды      

🧊 /heuristicmode - Включает базовый эвристический контроль обновлений игроков и серверов (будут анализироваться только изменения игроков и счета на сервере) (0 - отключено, 1 - включено).
      /hm - сокращённое наименование команды         


📌 /sp <имя игрока> - разовый поиск игрока без учета прочих ваших настроек (ограничения и возможность поиска по маске такие же, как описано выше по команде /addplayer)
  💡ВАЖНО: Если вы хотите искать игроков, в имени которых имеются пробелы, обрамляйте имя ковычками, например, /sp "\\*Q u a d\\*" и /sp "Q u a d e r" найдет игрока с ником Q u a D e R. а 

📌 /siq2 - отчёт наличия игроков на серверах Q2 с учетом настроек минимального кол-ва игроков /mp и фильтрации ботов /bf. 
📌 /siqw - отчёт наличия игроков на серверах QW с учетом настроек минимального кол-ва игроков /mp и фильтрации ботов /bf. 

📌 /stats, /sq2 и /sqw - статистика серверов. 
📌 /sq2m и /sqwm - мониторинг статистики серверов. 
📌 /fq2 <текст для поиска> и /fqw <текст для поиска> - поиск произвольной инфы. Например, /fq2 playground

📌 /ssq2 - разовый поиск сервера Q2 без учета прочих ваших настроек кроме настроек карт если (ограничения и возможность поискатакие же, как описано выше по команде /addserverq2).
📌 /ssqw - разовый поиск сервера QW без учета прочих ваших настроек кроме настроек карт если (ограничения и возможность поискатакие же, как описано выше по команде /addserverqw).

📌 /smq2 - разовый поиск карт на серверах Q2 без учета прочих ваших настроек (ограничения и возможность поискатакие же, как описано выше по команде /addserverq2).
  💡 Вы можете указывать в поиске сразу несколько карт - например, /smq2 \\*q2dm\\* \\*q2rdm\\* q2duel5 
📌 /smqw - разовый поиск карт на серверах QW без учета прочих ваших настроек (ограничения и возможность поискатакие же, как описано выше по команде /addserverqw).

📋 *Административные команды:*

- /helpadmin - показывает помощь по административным командам
      /ha - сокращённое наименование команды

💡 Идея, разработка и поддержка бота: ly (@QuakeJourney).
Квейк видео: @QuakeVideos, @QuakeChampionsVideos.

🎮 Поддерживаемые ботом игры: *${config.GAMES_SUPPORT}*

Версия бота: *${config.VERSION}*
`;

    const chunks = info.match(/(.|[\n\r]){1,4096}/g);
    for (const chunk of chunks) {
      console.log('chunk.length = ' + chunk.length);
      try {
        await ctx.reply(chunk, { parse_mode: 'Markdown' });
      }
      catch (error) {
        console.log(`Ошибка рассылки уведомлений: ${error.message}`);
      }
    }

    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('help', async (ctx) => {
  try {
    await help(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
}
);

bot.command('h', async (ctx) => {
  try {
    await help(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
}
);

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Проверка, является ли пользователь владельцем или администратором
async function isAdmin(userId) {
  try {
    const admins = await getAdmins(); // Получаем список администраторов
    return userId === ownerId || admins.includes(userId);
  } catch (error) { console.log(`Ошибка: `, error) };
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function isValidGames(games) {
  const allowedGames = config.GAMES.toLowerCase().split(','); // Преобразуем GAMES в нижний регистр
  try {
    for (const game of games) {
      if (!allowedGames.includes(game.toLowerCase())) { // Преобразуем game в нижний регистр
        return false;
      }
    }
    return true;
  } catch (error) {
    console.log(`Ошибка в функции isValidGames: `, error);
    return false;
  };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для указания игр, которые будет обрабатывать бот
async function addGames(ctx, games) {

  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

    const userSettings = await getUserSettings(userId);
    let existingGames;

    existingGames = userSettings && userSettings.games != undefined ? userSettings.games : [];
    //console.log('existingGames=' + existingGames.join(', '));
    if (games.length == 0 || !isValidGames(games)) {
      return ctx.reply(`Доступны следующие игры: ${config.GAMES}.\nВаши игры: ${existingGames.join(', ')}`);
    }

    for (let game of games) {

      game = formatName(game);

      if (!isValidPlayerName(game)) {
        return ctx.reply(`Название игры может одной или нескольких из списка: ${config.GAMES}.`);
      }
      if (existingGames.some(existingGame => matchPlayer(existingGame, game))) {
        return ctx.reply(`Игра ${game} уже добавлена. Ваши игры: ${existingGames.join(', ')}`);
      }

      existingGames.push(game.toLowerCase());
    }

    updateUserSettings(userId, { games: existingGames });

    let timerEnabled = userSettings.timerEnabled && userSettings.timerEnabled != undefined ? 0 : userSettings.timerEnabled;
    let monitoringEnabledText = "";

    if (await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 1 });
      await startAutoSearch(userId);
      monitoringEnabledText = `Мониторинг включён.\n`;
    }

    ctx.reply(`Игры добавлены: ${existingGames.join(', ')}
${monitoringEnabledText}
Используйте /ag для добавления игр для поиска и /ap для добавления игроков для мониторинга,
🕓 /timer для установки интервала автоматического мониторинга по заданным вами настройкам.
Просмотр информации по вашим настройкам: /info`);
  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для указания игр, которые будет обрабатывать бот
bot.command('addgame', async (ctx) => {
  try {
    games = prepareParam(ctx);
    if (games && games != undefined) {
      await addGames(ctx, games);
    }
  } catch (error) {
    console.log('Ошибка:', error.message);
  }
});

bot.command('ag', async (ctx) => {
  try {
    games = prepareParam(ctx);
    if (games && games != undefined) {
      await addGames(ctx, games);
    }
  } catch (error) { console.log(`Ошибка: `, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function checkCanTimer(userId) {
  try {
    let userSettings = await getUserSettings(userId);
    if (!userSettings) return false;
    const isGames = !(userSettings.games === undefined || userSettings.games.join("").trim() === '');
    //console.log('games: ', userSettings.games.join("").trim());
    const isPlayers = !(userSettings.players === undefined || userSettings.players.join("").trim() === '');
    const isQ2Settings = !((userSettings.q2servers === undefined || userSettings.q2servers.join("").trim() === '') && (userSettings.q2maps === undefined || userSettings.q2maps.join("").trim() === ''));
    const isQWSettings = !((userSettings.qwservers === undefined || userSettings.qwservers.join("").trim() === '') && (userSettings.qwmaps === undefined || userSettings.qwmaps.join("").trim() === ''));
    const isTimer = !(userSettings.timer === undefined || userSettings.timer == '' || userSettings.timer == 0);
    const statsMonitoringQ2 = userSettings && userSettings.sq2m != undefined ? userSettings.sq2m : 0;
    const statsMonitoringQW = userSettings && userSettings.sqwm != undefined ? userSettings.sqwm : 0;
    console.log('userId: ', userId);
    console.log('isGames: ', isGames);
    console.log('isPlayers: ', isPlayers);
    console.log('isQ2Settings: ', isQ2Settings);
    console.log('isQWSettings: ', isQWSettings);
    if ((!statsMonitoringQ2 && !statsMonitoringQW) && (!isGames || !isTimer || (isPlayers == false && isQ2Settings == false && isQWSettings == false))) return false; //Доработать чтобы учитывались игра совместно с серверами/игроками в играх
    else return true;
  } catch (error) {
    console.log(`Ошибка: `, error);
    return false;
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для удаления игр
async function delGame(ctx, games) {
  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    // console.log('player=' + players.length);
    //let playerWithoutQuotes = player.replace(/"/g, '');

    let userSettings = await getUserSettings(userId);

    if (games == undefined || games.length == 0) {
      //console.log(userSettings.players);
      return ctx.reply(`Укажите в параметрах команды игру, которую хотите удалить.`);
    }

    console.log('0');
    console.log(games);
    let existingGames = userSettings.games || [];

    if (!userSettings || existingGames == undefined || existingGames.length == 0) {
      //console.log(userSettings.players);
      return ctx.reply(`У вас нет настроек игр (нечего удалять).`);
    }

    console.log("1");
    console.log(existingGames);
    //console.log('players='+players);

    for (let i = 0; i < games.length; i++) {
      let game = games[i];
      if (!existingGames.includes(game.toLowerCase())) {
        //console.log(userSettings.players);
        return ctx.reply(`Игра(ы) ${game} не найдена(ы) в ваших настройках.\nВаши игры: ${existingGames.join(', ')}`);
      }
      existingGames = existingGames.filter(p => p.toLowerCase() !== game.toLowerCase());
    };

    console.log("2");
    console.log(existingGames);

    await updateUserSettings(userId, { games: existingGames });

    console.log("3");

    await ctx.reply(`Игра(ы) удалена(ы): ${games.join(', ')}`);

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      await ctx.reply(`Игр (/ag) или игроков (/ap) и серверов (/asq2 /asqw) для мониторинга больше нет, или ваш таймер выключен (/t), поэтому мониторинг отключён.`);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления игр
bot.command('delgame', async (ctx) => {
  try {

    games = prepareParam(ctx);
    if (games && games != undefined) {
      await delGame(ctx, games);
    }

  } catch (error) {
    console.log('Ошибка:', error.message);
  }
});

bot.command('dg', async (ctx) => {
  try {

    games = prepareParam(ctx);
    if (games && games != undefined) {
      await delGame(ctx, games);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /users
bot.command('users', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const users = await getAllUsers();
    if (users.length === 0) {
      return ctx.reply('Нет зарегистрированных пользователей.');
    }

    let message = 'Список пользователей:\n';

    for (const user of users) {
      try {
        const chat = await ctx.telegram.getChat(user.userId);
        const username = chat.username || 'не указано';
        const telegramUsername = chat.first_name || 'не указано'; // Можно использовать last_name или другие поля
        const isAdmin = user.isAdmin || false;
        const isOwner = user.userId === config.OWNER_ID || false;
        if (isAdmin) message += `⚠️ Админ бота. `;
        if (isOwner) message += `✅  Владелец бота. `;
        message += `ID: ${user.userId}, Имя: @${username}, ${telegramUsername}\n`;
        //"⚠️ SELL" : "✅  BUY"
      } catch (error) {
        console.log(`Ошибка при получении информации о пользователе ${user.userId}: ${error.message}`);
        message += `ID: ${user.userId}, Имя: ошибка при получении данных\n`;
      }
    }

    // Если сообщение слишком длинное, разбиваем его на части
    const chunks = message.match(/(.|[\n\r]){1,4096}/g); // Разбиваем на части по 4096 символов
    for (const chunk of chunks) {
      await ctx.reply(chunk);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /user <>
bot.command('user', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    //  const userSettings = await getUserSettings(userId);
    const userSettings = await getUserSettings(userId);

    if (!userSettings) {
      return ctx.reply(`Пользователь с ID ${userId} не найден.`);
    }

    try {
      const chat = await ctx.telegram.getChat(userId);
      const username = chat.username || 'не указано';
      const telegramUsername = chat.first_name || 'не указано'; // Можно использовать last_name или другие поля
      const isAdmin = userSettings.isAdmin || "нет";
      const players = userSettings.players || [];
      const timer = userSettings.timer !== undefined ? userSettings.timer : 'не установлен';
      const sleepTime = userSettings.sleepTime !== undefined ? userSettings.sleepTime : 'не установлено';
      let message = `
	Информация о пользователе:\n 
	ID: ${userId}, Имя: @${username}, ${telegramUsername}, Admin: ${isAdmin}\n
	Игроки: ${players.length > 0 ? players.join(', ') : 'нет'}
	Таймер: ${timer}
	Время сна: ${sleepTime}
	`;
      message += '\nВсе настройки:\n' + await getUserSettingsString(userId);
      // Если сообщение слишком длинное, разбиваем его на части
      const chunks = message.match(/(.|[\n\r]){1,4096}/g);
      for (const chunk of chunks) {
        await ctx.reply(chunk);
      }
    } catch (error) {
      console.log(`Ошибка при получении информации о пользователе ${userId}: ${error.message}`);
      const message = `ID: ${userId}: ошибка при получении данных\n`;
      await ctx.reply(message);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('deluser', async (ctx) => {
  try {
    const isOwner = ctx.from.id === config.OWNER_ID || false;
    console.log('ctx.from.userId = ' + ctx.from.userId + ', OWNER_ID = ' + config.OWNER_ID);
    if (!isOwner) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    //  const userSettings = await getUserSettings(userId);
    const userSettings = await getUserSettings(userId);

    if (!userSettings) {
      return ctx.reply(`Пользователь с ID ${userId} не найден.`);
    }

    try {
      const message = `ID: ${userId}: удалён\n`;
      await deleteUser(userId);
      await ctx.reply(message);
    } catch (error) {
      console.log(`Ошибка при получении информации о пользователе ${userId}: ${error.message}`);
      const message = `ID: ${userId}: ошибка при удалении данных\n`;
      await ctx.reply(message);
    }
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
});

bot.command('delallusers', async (ctx) => {
  try {
    const isOwner = ctx.from.id === config.OWNER_ID || false;
    if (!isOwner) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    //  const userSettings = await getUserSettings(userId);

    try {
      const message = `Все пользователи удалены.\n`;
      await deleteAllUsers();
      await ctx.reply(message);
    } catch (error) {
      console.log(`Ошибка удаления пользователей: ${error.message}`);
      const message = `Ошибка удаления пользователей.\n`;
      await ctx.reply(message);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /ban <userID>
bot.command('ban', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    await banUser(userId); // Предполагается, что функция реализована в db.js
    ctx.reply(`Пользователь с ID ${userId} заблокирован.`);
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
});

// Команда /unban <userID>
bot.command('unban', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    await unbanUser(userId); // Предполагается, что функция реализована в db.js
    ctx.reply(`Пользователь с ID ${userId} разблокирован.`);
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /banlist
bot.command('banlist', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const bannedUsers = await getBannedUsers(); // Предполагается, что функция реализована в db.js
    if (bannedUsers.length === 0) {
      return ctx.reply('Нет заблокированных пользователей.');
    }

    let message = 'Список заблокированных пользователей:\n';
    //bannedUsers.forEach(user => {

    for (const user of bannedUsers) {
      try {
        const chat = await ctx.telegram.getChat(user.userId);
        const username = chat.username || 'не указано';
        const telegramUsername = chat.first_name || 'не указано'; // Можно использовать last_name или другие поля

        message += `ID: ${user.userId}, Имя: @${username}, ${telegramUsername}\n`;
      } catch (error) {
        console.log(`Ошибка при получении информации о пользователе ${user.userId}: ${error.message}`);
        message += `ID: ${user.userId}, Имя: ошибка при получении данных\n`;
      }
      //message += `ID: ${user.userId}, Имя: ${user.username || 'не указано'}, @: ${user.telegramUsername || 'не указано'}\n`;
    };

    const chunks = message.match(/(.|[\n\r]){1,4096}/g);
    for (const chunk of chunks) {
      await ctx.reply(chunk);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /addadm пользователя Telegram>
bot.command('addadm', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }
    const userId = ctx.message.text.split(' ')[1];
    //  const userSettings = await getUserSettings(userId);
    const userSettings = await getUserSettings(userId);

    if (!userSettings) {
      return ctx.reply(`Пользователь с ID ${userId} не найден.`);
    }

    if (await addAdmin(userId)) {
      ctx.reply(`Пользователь ${userId} добавлен в администраторы.`);
    } else {
      ctx.reply(`Не удалось добавить пользователя с ID ${userId} в администраторы`);
    }
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
});

// Команда /deladm <userID>
bot.command('deladm', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    await removeAdmin(userId); // Предполагается, что функция реализована в db.js
    ctx.reply(`Пользователь с ID ${userId} удален из администраторов.`);
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /admlist
bot.command('admlist', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const admins = await getAdmins(); // Предполагается, что функция реализована в db.js
    if (admins.length === 0) {
      return ctx.reply('Нет администраторов.');
    }

    let message = 'Список администраторов:\n';
    admins.forEach(admin => {
      message += `ID: ${admin.userId}, Имя: ${admin.username || 'не указано'}, @: ${admin.telegramUsername || 'не указано'}\n`;
    });

    const chunks = message.match(/(.|[\n\r]){1,4096}/g);
    for (const chunk of chunks) {
      await ctx.reply(chunk);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

// Команда /delalladm
bot.command('delalladm', async (ctx) => {
  try {
    if (ctx.from.id !== ownerId) {
      return ctx.reply('Только владелец может использовать эту команду.');
    }

    await removeAllAdmins(); // Предполагается, что функция реализована в db.js
    ctx.reply('Все администраторы были удалены.');
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function prepareParam(ctx) {
  try {
    let data = [];
    let current = "";
    let inQuotes = false; // Флаг, отслеживающий нахождение в кавычках
    let inStar = false;

    const parts = ctx.message.text.split(/(\s+)/).slice(1); // Сохраняет пробелы

    for (let i = 0; i < parts.length; i++) {
      const part = parts[i];

      if (part.startsWith('"') && part.endsWith('"')) {
        // Текст в кавычках
        data.push(part);
      } else if (part.startsWith('"')) {
        // Начало текста в кавычках
        current += part; // не удаляем начальную кавычку
        inQuotes = true;
      } else if (part.endsWith('"')) {
        // Конец текста в кавычках
        current += part; // не удаляем конечную кавычку
        data.push(current);
        current = "";
        inQuotes = false;
      } else if (inQuotes) {
        // Продолжение текста в кавычках
        current += part; // добавляем без пробела
      } else if (part.startsWith('*') && part.endsWith('*')) {
        // Текст в звездочках
        data.push(part);
      } else if (part.startsWith('*')) {
        // Начало текста в звездочках
        current += part; // не удаляем начальную звездочку
        inStar = true;
      } else if (inStar && !part.endsWith('*')) {
        // Продолжение текста в звездочках
        current += part;
      } else if (inStar && part.endsWith('*')) {
        // Конец текста в звездочках
        current += part;
        data.push(current);
        current = "";
        inStar = false;
      } else if (part.endsWith('*')) {
        // Текст заканчивается звездочкой
        current += part;
        data.push(current);
        current = "";
        inStar = false;
      } else {
        // Обычный текст, добавляем его
        data.push(part);
      }
    }
    // Если остались не завершённые текущие данные, добавляем их
    if (current) {
      data.push(current);
    }

    data = data.filter(item => item.trim() !== '');
    data = data.filter((item, index, self) => {
      const lowercaseItem = item.toLowerCase();
      return index === self.findIndex(otherItem => otherItem.toLowerCase() === lowercaseItem);
    });


    console.log("prepareParam=" + data.join(", "));
    return data;



  } catch (error) { console.log(`Ошибка: `, error); }
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки, входит ли пользователь в группы
async function checkUserInGroups(userId, groupUsernames) {
  try {
    const results = {};
    for (const username of groupUsernames) {
      try {
        // Убираем "@" из имени группы
        const chat = await bot.getChat(username.replace('@', ''));
        const member = await bot.getChatMember(chat.id, userId);

        // Проверяем статус пользователя в группе
        results[username] = member.status === 'member' || member.status === 'administrator' || member.status === 'creator';
      } catch (error) {
        console.log(`Ошибка при проверке группы ${username}:`, error.message);
        results[username] = false; // Если возникает ошибка, считаем, что пользователь не в группе
      }
    }

    return results;
  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('check', async (ctx) => {
  try {
    const userId = ctx.from.id;
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    const groupUsernames = ['@QuakeJourney', '@Quake2Workshop']; // Массив @-имен групп
    checkUserInGroups(userId, groupUsernames)
      .then(results => {
        console.log('Результаты проверки:', results);
        ctx.reply('Результаты проверки:' + results);
      })
      .catch(err => {
        console.log('Ошибка:', err);
      });
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для добавления игроков
async function addPlayers(ctx, players, type) {

  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

    const userSettings = await getUserSettings(userId);
    let existingPlayers;

    let prevTimerEnabled = userSettings.timerEnabled;
    prevTimerEnabled = (!prevTimerEnabled || prevTimerEnabled == undefined || prevTimerEnabled == '' || prevTimerEnabled == 0) ? 0 : prevTimerEnabled;

    if (type == 'players') {
      existingPlayers = userSettings && userSettings.players != undefined ? userSettings.players : [];
      if (players.length == 0 || players.length > config.PLAYERS_COUNT_LIMIT) {
        return ctx.reply(`Вы можете добавить от 1 до ${config.PLAYERS_COUNT_LIMIT - existingPlayers.length} игроков.\nВаши игроки: ${existingPlayers.join(', ')}`);
      }
      if (existingPlayers.length >= config.PLAYERS_COUNT_LIMIT) {
        return ctx.reply('Достигнуто максимальное количество игроков. Удалите кого-то перед добавлением (/delplayer или /dp).');
      }
    }
    else if (type == 'playersfilter') {
      existingPlayers = userSettings && userSettings.playersFilter != undefined ? userSettings.playersFilter : [];
      if (players.length == 0 || players.length > config.PLAYERS_COUNT_LIMIT) {
        return ctx.reply(`Вы можете добавить от 1 до ${config.PLAYERS_COUNT_LIMIT - existingPlayers.length} игроков для фильтра.\nВаш текущий фильтр: ${existingPlayers.join(', ')}`);
      }
      if (existingPlayers.length >= config.PLAYERS_COUNT_LIMIT) {
        return ctx.reply('Достигнуто максимальное количество игроков. Удалите кого-то перед добавлением (/delplayerfilter ли /dpf).');
      }
    }
    else if (type == 'spfilter') {
      existingPlayers = userSettings && userSettings.spFilter != undefined ? userSettings.spFilter : [];
      if (players.length < 2 || players.length > config.PLAYERS_COUNT_LIMIT - 1) {
        return ctx.reply(`Вы можете добавить от 1 до ${config.PLAYERS_COUNT_LIMIT - existingPlayers.length} записей фильтра сервер-игрок.\nИспользуйте команду /aspf <server:ip\\player>,\nнапример /aspf q2.playground.ru:27910 pp\nВаш текущий фильтр: ${existingPlayers.join(', ')}`);
      }
      if (existingPlayers.length >= config.PLAYERS_COUNT_LIMIT) {
        return ctx.reply('Достигнуто максимальное количество пар фильтра сервер-игрок. Удалите что нибудь перед добавлением (/dspf).');
      }
    }

    //console.log('type=' + type);
    //console.log(players);
    //console.log(players.length);
    //console.log(players[0]);
    //const existingPlayers = userSettings.players || [];
    let result;

    if (type == 'players' || type == 'playersfilter') {

      for (let player of players) {
        player = formatName(player);

        if (!isValidPlayerName(player)) {
          return ctx.reply(`🕵️ Имя игрока должно состоять из минимум ${config.PLAYERS_NICK_NAME_LIMIT} символа(ов). Если используется маска, то минимум ${config.PLAYERS_NICK_NAME_LIMIT} символа(ов) + одна или две звездочки.`);
        }

        if (existingPlayers.some(existingPlayer => matchPlayer(existingPlayer, player))) {
          return ctx.reply(`🕵️ Игрок ${player} уже добавлен. Ваши игроки: ${existingPlayers.join(', ')}`);
        }
        existingPlayers.push(player.toLowerCase());
      }
      result = `${type == 'players' ? 'Игроки' : '🕵️ Игроки в фильтр'} добавлены: ${players.join(',')}\nТекущий список: ${existingPlayers.join(', ')}
Используйте /ag для добавления игр для поиска и 🕓 /timer для установки интервала автоматического мониторинга по заданным вами настройкам.
Просмотр информации по вашим настройкам: /info`;
    }
    else if (type == 'spfilter') {
      let server = players[0];
      let player = formatName(players[1]);
      //console.log('server=' + server + ', player=' + player);
      if (!isValidServer(server)) return ctx.reply(`🖥️Адрес сервера должнен быть указан в виде IPAddress:Port или Domen:Port, например, 212.42.38.88:27910 или q2.playground.ru:27910\nВы пытались добавить сервер: '${server}'\nУкажите верно параметры команды, например: /aspf 212.42.38.88:27910 pp`);
      if (!isValidPlayerName(player)) return ctx.reply(`🕵️ Имя игрока должно состоять из минимум ${config.PLAYERS_NICK_NAME_LIMIT} символа(ов). Если используется маска, то минимум ${config.PLAYERS_NICK_NAME_LIMIT} символа(ов) + одна или две звездочки.\nУкажите верно параметры команды, например: /aspf q2.playground.ru pp`);

      for (i = 0; i < existingPlayers.length; i++) {
        let existingServer = existingPlayers[i].split(`\\`)[0];
        let existingPlayer = existingPlayers[i].split(`\\`)[1];
        if (matchServer(existingServer, server) && matchPlayer(existingPlayer, player)) return ctx.reply(`Такая пара сервер-игрок уже добавлена. Ваш фильтр: ${existingPlayers.join(', ').replace('\\', ' ')}`);
      }
      let sp = server + `\\` + player;
      existingPlayers.push(sp);
      result = `🖥️🕵️ Добавлена новая пара сервер-игрок: ${server} ${player} 
Для удаления воспользуйтесь командой:
/dspf ${server} ${player}
Используйте /ag для добавления игр для поиска и 🕓 /timer для установки интервала автоматического мониторинга по заданным вами настройкам.
Просмотр информации по вашим настройкам: /info`;
    }

    if (type == 'players') await updateUserSettings(userId, { players: existingPlayers });
    else if (type == 'playersfilter') await updateUserSettings(userId, { playersFilter: existingPlayers });
    else if (type == 'spfilter') await updateUserSettings(userId, { spFilter: existingPlayers });

    await ctx.reply(result);

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      await ctx.reply(`👁️ Не заполнены необходимые параметры для старта автоматического монитора, поэтому мониторинг отключён.\nМониторинг будет автоматически включен в случае если вы добавите требуемые настройки для мониторинга и включите таймер.\n/help для информации.`);
    }
    else if (await checkCanTimer(userId) && userSettings.timer && userSettings.timer != undefined && userSettings.timer != '' && userSettings.timer >= 30) {
      //timerEnabled = userSettings.timerEnabled;

      await stopAutoSearch(userId); //на всякий случай
      await updateUserSettings(userId, { timerEnabled: 1 });
      await startAutoSearch(userId, userSettings.timer);
      if (prevTimerEnabled == 0) {
        await ctx.reply(`👁️ Мониторинг включён.\nТекущий таймер обновления: ${userSettings.timer}\nЕсли вы хотите отключить моинторинг, воспользуйтесь командой 🕓 /timer 0`);
      }
    }

  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления игроков
bot.command('addplayer', async (ctx) => {
  try {
    players = prepareParam(ctx);
    if (players && players != undefined) {
      await addPlayers(ctx, players, 'players');
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

bot.command('ap', async (ctx) => {
  try {
    players = prepareParam(ctx);
    if (players && players != undefined) {
      await addPlayers(ctx, players, 'players');
    }
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления фильтра игроков
bot.command('addplayerfilter', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      //console.log(players);
      //console.log(players[0]);
      await addPlayers(ctx, players, 'playersfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

// Команда для добавления фильтра игроков
bot.command('apf', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      //console.log(players);
      //console.log(players[0]);
      await addPlayers(ctx, players, 'playersfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления фильтра пары сервер + игрок
bot.command('aspf', async (ctx) => {
  try {

    let sp = prepareParam(ctx);
    if (sp && sp != undefined) {
      //console.log(players);
      //console.log(players[0]);
      await addPlayers(ctx, sp, 'spfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для преобразования и форматирования массива для фильтра server - player
function formatServers(arr) {
  //console.log('formatServers');
  if (arr == undefined || arr.length == 0) return '';
  const result = arr.map(item => {
    return item.replace(/\\/g, ' '); // Заменяем обратные слэши на пробелы
  }).join(', '); // Объединяем результаты с запятой и пробелом
  return result;
}

// Функция для преобразования и форматирования массива для фильтра server - player
function formatServerString(server) {
  //console.log('formatServer');
  if (!server || server == undefined || server.trim() == '') return '';
  const result = server.replace(/\\/g, ' '); // Заменяем обратные слэши на пробелы
  return result;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для удаления игроков
async function delPlayers(ctx, players, type) {
  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    // console.log('player=' + players.length);
    //let playerWithoutQuotes = player.replace(/"/g, '');

    let userSettings = await getUserSettings(userId);

    console.log('delPlayer - ' + type);
    console.log(players);

    let existingPlayers;

    if (type == 'players') {

      if (players == undefined || players.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`Укажите в параметрах команды игрока(ов), которого(ых) хотите удалить.\nНапример: /dp David`);
      }

      existingPlayers = userSettings.players || [];
      if (!userSettings || existingPlayers == undefined || existingPlayers.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`У вас нет настроек игроков (нечего удалять).`);
      }
      for (let i = 0; i < players.length; i++) {
        let player = players[i];
        console.log('player=' + player);
        if (!existingPlayers.includes(player.toLowerCase())) {
          //console.log(userSettings.players);
          return ctx.reply(`Игрок ${player} не найден(ы) в ваших настройках.\nВаши игроки: ${existingPlayers.join(', ')}`);
        }
        existingPlayers = existingPlayers.filter(p => p.toLowerCase() !== player.toLowerCase());
      };
      await updateUserSettings(userId, { players: existingPlayers });
      ctx.reply('🕵️ Игроки удалены: ' + players.join(','));
    }
    else if (type == 'playersfilter') {

      if (players == undefined || players.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`Укажите в параметрах команды игрока(ов), которого(ых) хотите удалить из фильтра.\nНапример: /dpf David`);
      }

      existingPlayers = userSettings.playersFilter || [];
      if (!userSettings || existingPlayers == undefined || existingPlayers.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`У вас нет настроек фильтров игроков (нечего удалять).`);
      }
      for (let i = 0; i < players.length; i++) {
        let player = players[i];
        console.log('player=' + player);
        if (!existingPlayers.includes(player.toLowerCase())) {
          //console.log(userSettings.players);
          return ctx.reply(`Игрок ${player} не найден(ы) в ваших настройках фильтра игроков.\nВаши игроки в фильтре: ${existingPlayers.join(', ')}`);
        }
        existingPlayers = existingPlayers.filter(p => p.toLowerCase() !== player.toLowerCase());
      };
      await updateUserSettings(userId, { playersFilter: existingPlayers });
      ctx.reply('🕵️ Игроки удалены из фильтра: ' + players.join(','));
    }
    else if (type == 'spfilter') {

      if (players == undefined || players.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`Укажите в параметрах команды пару сервер - игрок, которые хотите удалить.\nНапример: /dspf q2.playground.ru:27910 David`);
      }

      //existingPlayers = userSettings.spFilter || [];
      existingPlayers = userSettings && userSettings.spFilter != undefined ? userSettings.spFilter : [];

      if (!userSettings || existingPlayers == undefined || existingPlayers.length == 0) {
        //console.log(userSettings.players);
        return ctx.reply(`У вас нет настроек фильтров сервер - игрок (нечего удалять).`);
      }

      let server = players[0];
      let player = formatName(players[1]);
      let sp = server + `\\` + player;
      if (!existingPlayers.map(player => player.toLowerCase()).includes(sp.toLowerCase())) {
        ;
        //      if (!existingPlayers.includes(sp.toLowerCase())) {
        //console.log(userSettings.players);
        return ctx.reply(`Значение ${server} ${player} не найдено в ваших настройках фильтра сервер -игрок.\nВаши текущие параметры фильтра: ${formatServers(existingPlayers)}`);
      }
      existingPlayers = existingPlayers.filter(p => p.toLowerCase() !== sp.toLowerCase());
      await updateUserSettings(userId, { spFilter: existingPlayers });
      ctx.reply('🖥️🕵️ Настройки фильтра удалены: ' + server + ' ' + player);
    }


    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      ctx.reply(`👁️ Игроков и серверов для мониторинга больше нет, поэтому мониторинг отключён.`);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления игроков
bot.command('delplayer', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      await delPlayers(ctx, players, 'players');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

bot.command('dp', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      await delPlayers(ctx, players, 'players');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления игроков
bot.command('delplayerfilter', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      await delPlayers(ctx, players, 'playersfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

bot.command('dpf', async (ctx) => {
  try {

    players = prepareParam(ctx);
    if (players && players != undefined) {
      await delPlayers(ctx, players, 'playersfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('dspf', async (ctx) => {
  try {

    sp = prepareParam(ctx);
    if (sp && sp != undefined) {
      await delPlayers(ctx, sp, 'spfilter');
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function isValidServer(serverString) {
  try {
    console.log('isValidServer - input = ' + serverString);
    if (!serverString) return false;
    if (serverString == undefined) return false;
    if (serverString.trim() == '') return false;

    // Разделяем строку на IP/домен и порт
    const [address, port] = serverString.split(':');

    // Проверяем порт - должен быть числом
    if (isNaN(parseInt(port, 10))) {
      return false;
    }

    // Проверяем IP - должен быть числом или доменом
    if (address.match(/^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/)) {
      return true; // Это IP-адрес
    } else if (address.match(/^(?:[a-z0-9](?:[a-z0-9-]{0,61}[a-z0-9])?\.)+[a-z0-9][a-z0-9-]{0,61}[a-z0-9]$/i)) {
      return true; // Это домен
    } else {
      return false;
    }
  } catch (error) {
    console.log(`Ошибка: `, error);
    return false;
  }
}


function isValidServerOld(server) {
  //console.log('isValidServer, server=' + server);
  const regex = /^(([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5]):([1-9][0-9]{0,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5])$|^(?:[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]+)*):([1-9][0-9]{0,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5])$/;
  return regex.test(server);
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для добавления Q2 серверов
async function addServers(ctx, servers, game) {

  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME;
    }
    //console.log('addserverq2s');
    //console.log(servers);

    const userSettings = await getUserSettings(userId);
    let existingServers;

    let prevTimerEnabled = userSettings.timerEnabled;
    prevTimerEnabled = (!prevTimerEnabled || prevTimerEnabled == undefined || prevTimerEnabled == '' || prevTimerEnabled == 0) ? 0 : prevTimerEnabled;

    if (game == 'q2') existingServers = userSettings && userSettings.q2servers != undefined ? userSettings.q2servers : [];
    else if (game == 'qw') existingServers = userSettings && userSettings.qwservers != undefined ? userSettings.qwservers : [];

    if (servers.length == 0 || ((servers.length + existingServers.length) > config.SERVERS_COUNT_LIMIT)) {
      return await ctx.reply(`Вы можете добавить от 1 до ${config.SERVERS_COUNT_LIMIT - existingServers.length} серверов.\nВаши сервера: ${existingServers.join(', ')}`);
    }

    /*    if (servers.length === 0 || servers.length > config.SERVERS_COUNT_LIMIT) {
          return ctx.reply(`Вы можете добавить от 1 до ${config.SERVERS_COUNT_LIMIT} серверов.`);
        }
    */
    for (const server of servers) {
      if (!isValidServer(server)) {
        return await ctx.reply(`Адрес сервера должнен быть указан в виде IPAddress:Port или Domen:Port, например, 212.42.38.88:27910 или q2.playground.ru:27910\nВы пытались добавить сервер: '${server}'`);
      }
      if (existingServers.some(existingServer => matchServer(existingServer, server))) {
        return await ctx.reply(`Сервер ${server} уже добавлен. Ваши сервера: ${existingServers.join(', ')}`);
      }

      if (existingServers.length >= config.SERVERS_COUNT_LIMIT) {
        return await ctx.reply('Достигнуто максимальное количество серверов. Удалите какой-нибудь перед добавлением нового (/dellq2server).');
      }
      existingServers.push(normalNameHard(server).toLowerCase());
    }

    if (game == 'q2') await updateUserSettings(userId, { q2servers: existingServers });
    else if (game == 'qw') await updateUserSettings(userId, { qwservers: existingServers });

    await ctx.reply(`🖥️ Сервера добавлены: ${existingServers.join(', ')}
Используйте /ag для добавления игр для поиска и 🕓 /timer для установки интервала автоматического мониторинга по заданным вами настройкам.
Просмотр информации по вашим настройкам: /info`);

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      await ctx.reply(`👁️ Не заполнены необходимые параметры для старта автоматического мониторинга, сейчас мониторинг отключён.\nМониторинг будет автоматически включён в случае если вы добавите необходимые настройки для мониторинга и включите таймер.\n/help для информации.`);
    }
    else if (await checkCanTimer(userId) && userSettings.timer && userSettings.timer != undefined && userSettings.timer != '' && userSettings.timer >= 30) {
      await stopAutoSearch(userId); //на всякий случай
      await updateUserSettings(userId, { timerEnabled: 1 });
      await startAutoSearch(userId, userSettings.timer);
      if (prevTimerEnabled == 0) {
        await ctx.reply(`👁️ Мониторинг включён.\nТекущий таймер обновления: ${userSettings.timer}\nЕсли вы хотите отключить моинторинг, воспользуйтесь командой 🕓 /timer 0`);
      }
    }

  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления Q2 серверов
bot.command('addserverq2', async (ctx) => {
  try {
    const servers = ctx.message.text.split(' ').slice(1);
    await addServers(ctx, servers, 'q2');
  } catch (error) {
    console.log(`Ошибка: `, error);
    ctx.reply(`Укажите Q2 сервер(а) в формате ServerIP(или домен):Port/ServerName, например - /addserverq2 q2.playground.ru:27910\nЕсли вы хотите указать несколько серверов, то разделяйте их пробелами.\nВы также можете использовать сокращённый формат команды - /asq2`);
  }
});

bot.command('asq2', async (ctx) => {
  try {
    const servers = ctx.message.text.split(' ').slice(1);
    await addServers(ctx, servers, 'q2');
  } catch (error) {
    console.log(`Ошибка: `, error);
    ctx.reply(`Укажите Q2 сервер(а) в формате ServerIP(или домен):Port/ServerName, например - /addserverq2 q2.playground.ru:27910\nЕсли вы хотите указать несколько серверов, то разделяйте их пробелами.\nВы также можете использовать сокращённый формат команды - /asq2`);
  }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления Q2 серверов
bot.command('addserverqw', async (ctx) => {
  try {
    const servers = ctx.message.text.split(' ').slice(1);
    await addServers(ctx, servers, 'qw');
  } catch (error) {
    console.log(`Ошибка: `, error);
    ctx.reply(`Укажите QW сервер(а) в формате ServerIP(или домен):Port/ServerName, например - /addserverqw 35.185.44.174:27500\nЕсли вы хотите указать несколько серверов, то разделяйте их пробелами.\nВы также можете использовать сокращённый формат команды - /asqw`);
  }
});

bot.command('asqw', async (ctx) => {
  try {
    const servers = ctx.message.text.split(' ').slice(1);
    await addServers(ctx, servers, 'qw');
  } catch (error) {
    console.log(`Ошибка: `, error);
    ctx.reply(`Укажите Q2 сервер(а) в формате ServerIP(или домен):Port/ServerName, например - /addserverqw 35.185.44.174:27500\nЕсли вы хотите указать несколько серверов, то разделяйте их пробелами.\nВы также можете использовать сокращённый формат команды - /asqw`);
  }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки валидности имени игрока
function isValidPlayerName(name) {
  try {
    // Убираем кавычки, если они есть
    name = name.replace(/"/g, '');
    const trimmedName = name.replace(/\*/g, '').trim();
    const nameHasMask = name.includes('*');
    const minLength = nameHasMask ? config.PLAYERS_NICK_NAME_MASK_LIMIT : config.PLAYERS_NICK_NAME_LIMIT;
    return trimmedName.length >= minLength && (nameHasMask ? name.match(/\*/g).length <= 2 : true);
  } catch (error) {
    console.log(`Ошибка: `, error);
    return false; // Возвращаем false в случае ошибки
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки валидности имени игрока
function isValidMapName(name) {
  try {
    // Убираем кавычки, если они есть
    console.log('isValidMapName, name=' + name);
    name = name.replace(/"/g, '');
    const trimmedName = name.replace(/\*/g, '').trim();
    const nameHasMask = name.includes('*');
    const minLength = nameHasMask ? config.MAPS_NAME_MASK_LIMIT : config.MAPS_NAME_LIMIT;
    return trimmedName.length >= minLength && (nameHasMask ? name.match(/\*/g).length <= 2 : true);
  } catch (error) {
    console.log(`Ошибка: `, error);
    return false; // Возвращаем false в случае ошибки
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки валидности имени игрока
function isValidPlayerName2adadasda(name) {
  try {
    const trimmedName = name.replace(/\*/g, '').trim();
    const nameHasMask = name.includes('*');
    const minLength = nameHasMask ? config.PLAYERS_NICK_NAME_MASK_LIMIT : config.PLAYERS_NICK_NAME_LIMIT;
    return trimmedName.length >= minLength && (nameHasMask ? name.match(/\*/g).length <= 2 : true);
  } catch (error) {
    console.log(`Ошибка: `, error);
    return false; // Возвращаем false в случае ошибки
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки соответствия имени игрока с учетом маски
function matchPlayer(existingPlayer, newPlayer) {
  try {
    // Убираем регистр для сравнения
    const lowerExistingPlayer = existingPlayer.toLowerCase();
    const lowerNewPlayer = formatName(newPlayer.toLowerCase());
    //console.log('existingPlayer=' + existingPlayer + ', newPlayer=' + newPlayer);
    //console.log('existingPlayer=' + existingPlayer + ', newPlayer = ' + newPlayer);

    // Проверяем наличие маски
    if (lowerExistingPlayer.startsWith('*') && lowerExistingPlayer.endsWith('*')) {
      // *text* - ищем текст в середине
      const searchText = lowerExistingPlayer.slice(1, -1);
      return lowerNewPlayer.includes(searchText);
    } else if (lowerExistingPlayer.startsWith('*')) {
      // *text - ищем текст в конце
      const searchText = lowerExistingPlayer.slice(1);
      return lowerNewPlayer.endsWith(searchText);
    } else if (lowerExistingPlayer.endsWith('*')) {
      // text* - ищем текст в начале
      const searchText = lowerExistingPlayer.slice(0, -1);
      return lowerNewPlayer.startsWith(searchText);
    }

    // Полное соответствие
    return lowerExistingPlayer === lowerNewPlayer;
  } catch (error) { console.log(`Ошибка: `, error); }
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для проверки соответствия имени игрока с учетом маски
function matchServer(existingServer, newServer) {
  try {
    // Убираем регистр для сравнения
    //console.log('matchServer. existingServer='+existingServer+', newServer='+newServer);
    const lowerExistingServer = formatServerString(existingServer.toLowerCase());
    const lowerNewSerer = formatServerString(newServer.toLowerCase());

    //console.log('existingPlayer=' + existingPlayer + ', newPlayer = ' + newPlayer);
    /*
        // Проверяем наличие маски
        if (lowerExistingServer.startsWith('*') && lowerExistingServer.endsWith('*')) {
          // *text* - ищем текст в середине
          const searchText = lowerExistingServer.slice(1, -1);
          return lowerNewSerer.includes(searchText);
        } else if (lowerExistingServer.startsWith('*')) {
          // *text - ищем текст в конце
          const searchText = lowerExistingServer.slice(1);
          return lowerNewSerer.endsWith(searchText);
        } else if (lowerExistingServer.endsWith('*')) {
          // text* - ищем текст в начале
          const searchText = lowerExistingServer.slice(0, -1);
          return lowerNewSerer.startsWith(searchText);
        }
    */
    // Полное соответствие
    return lowerExistingServer == lowerNewSerer;
  } catch (error) { console.log(`Ошибка: `, error); }
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для удаления Q2 серверов
async function delServer(ctx, server, game) {
  try {
    const userId = getUserID(ctx);

    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME;
    }

    let userSettings = await getUserSettings(userId);

    let prevTimerEnabled = userSettings.timerEnabled;
    prevTimerEnabled = (!prevTimerEnabled || prevTimerEnabled == undefined || prevTimerEnabled == '' || prevTimerEnabled == 0) ? 0 : prevTimerEnabled;


    if (game == 'q2') existingServers = userSettings && userSettings.q2servers != undefined ? userSettings.q2servers : [];
    else if (game == 'qw') existingServers = userSettings && userSettings.qwservers != undefined ? userSettings.qwservers : [];

    if (!existingServers.includes(server.toLowerCase())) {
      return await ctx.reply(`Сервер ${server} не найден в ваших настройках серверов\nВаши ${game} сервера: ${existingServers.join(', ')}`);
    }

    const updatedServers = existingServers.filter(p => p.toLowerCase() !== server.toLowerCase());
    console.log('delServer. game:' + game + ', existingServers = ' + existingServers.join(', ') + ', сервер для удаления: ' + server + ', updatedServers = ' + updatedServers.join(', '));
    let serversLeft;
    if (game == 'q2') {
      await updateUserSettings(userId, { q2servers: updatedServers });
      userSettings = await getUserSettings(userId);
      const q2servers = userSettings && userSettings.q2servers != undefined ? userSettings.q2servers : [];
      serversLeft = `${q2servers.length > 0 ? q2servers.join(', ') : 'нет - используйте /asq2'}.`;
    }
    else if (game == 'qw') {
      await updateUserSettings(userId, { qwservers: updatedServers });
      userSettings = await getUserSettings(userId);
      const qwservers = userSettings && userSettings.qwservers != undefined ? userSettings.qwservers : [];
      serversLeft = `${qwservers.length > 0 ? qwservers.join(', ') : 'нет - используйте /asqw'}.`;
    }

    await ctx.reply(`🖥️ Сервер ${server} удален.\nОстальные ${game} сервера:\n${serversLeft}`);

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      if (prevTimerEnabled == 1) await ctx.reply(`👁️ Игр, игроков и серверов для мониторинга больше нет, поэтому мониторинг отключён.`);
    }
  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления Q2 серверов
bot.command('delserverq2', async (ctx) => {
  try {
    const server = ctx.message.text.split(' ')[1];
    await delServer(ctx, server, 'q2');
  } catch (error) { console.log(`Ошибка: `, error); }
});

// Команда для удаления Q2 серверов
bot.command('dsq2', async (ctx) => {
  try {
    const server = ctx.message.text.split(' ')[1];
    await delServer(ctx, server, 'q2');
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления QW серверов
bot.command('delserverqw', async (ctx) => {
  try {
    const server = ctx.message.text.split(' ')[1];
    await delServer(ctx, server, 'qw');
  } catch (error) { console.log(`Ошибка: `, error); }
});

// Команда для удаления Q2 серверов
bot.command('dsqw', async (ctx) => {
  try {
    const server = ctx.message.text.split(' ')[1];
    await delServer(ctx, server, 'qw');
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для добавления игроков
async function addMaps(ctx, maps, game) {

  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });

    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME;
    }

    const userSettings = await getUserSettings(userId);
    let existingMaps;
    if (game == 'q2') existingMaps = userSettings && userSettings.q2maps != undefined ? userSettings.q2maps : [];
    if (game == 'qw') existingMaps = userSettings && userSettings.qwmaps != undefined ? userSettings.qwmaps : [];

    if (maps.length == 0 || ((maps.length + existingMaps.length) > config.MAPS_COUNT_LIMIT)) {
      return ctx.reply(`Вы можете добавить от 1 до ${config.MAPS_COUNT_LIMIT - existingMaps.length} карт(ы).\nВаши карты: ${existingMaps.join(', ')}`);
    }

    /*
    if (maps.length === 0 || maps.length > config.MAPS_COUNT_LIMIT) {
      return ctx.reply(`Вы можете добавить от 1 до ${config.MAPS_COUNT_LIMIT} карт.`);
    }
      
    const userSettings = await getUserSettings(userId);
    const existingMaps = userSettings.q2maps || [];
    */

    for (let map of maps) {

      map = formatName(map);

      if (!isValidMapName(map)) {
        return ctx.reply(`Название карты должно состоять из минимум ${config.MAPS_NAME_LIMIT} символа(ов). Если используется маска, то минимум ${config.MAPS_NAME_MASK_LIMIT} символа(ов) + одна или две звездочки.`);
      }
      if (existingMaps.some(existingMap => matchPlayer(existingMap, map))) {
        return ctx.reply(`Карта ${map} уже добавлена. Ваши карты: ${existingMaps.join(', ')}`);
      }

      if (existingMaps.length >= config.MAPS_COUNT_LIMIT) {
        return ctx.reply('Достигнуто максимальное число карт. Удалите что нибудь перед добавлением (/delmapq2).');
      }
      existingMaps.push(map.toLowerCase());
    }

    if (game == 'q2') await updateUserSettings(userId, { q2maps: existingMaps });
    if (game == 'qw') await updateUserSettings(userId, { qwmaps: existingMaps });
    ctx.reply(`Карты добавлены: ${existingMaps.join(', ')}
Используйте /ag для добавления игр для поиска и 🕓 /timer для установки интервала автоматического мониторинга по заданным вами настройкам.
Просмотр информации по вашим настройкам: /info`);
  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/
function parseMap(ctx) {
  try {
    let maps = [];
    let currentMap = "";
    let inQuotes = false; // Флаг, отслеживающий нахождение в кавычках
    let inStar = false;

    const parts = ctx.message.text.split(/(\s+)/).slice(1); // Сохраняет пробелы

    for (let i = 0; i < parts.length; i++) {
      const part = parts[i];

      if (part.startsWith('"') && part.endsWith('"')) {
        // Текст в кавычках
        maps.push(part);
      } else if (part.startsWith('"')) {
        // Начало текста в кавычках
        currentMap += part; // не удаляем начальную кавычку
        inQuotes = true;
      } else if (part.endsWith('"')) {
        // Конец текста в кавычках
        currentMap += part; // не удаляем конечную кавычку
        maps.push(currentMap);
        currentMap = "";
        inQuotes = false;
      } else if (inQuotes) {
        // Продолжение текста в кавычках
        currentMap += part; // добавляем без пробела
      } else if (part.startsWith('*') && part.endsWith('*')) {
        // Текст в звездочках
        maps.push(part);
      } else if (part.startsWith('*')) {
        // Начало текста в звездочках
        currentMap += part; // не удаляем начальную звездочку
        inStar = true;
      } else if (inStar && !part.endsWith('*')) {
        // Продолжение текста в звездочках
        currentMap += part;
      } else if (inStar && part.endsWith('*')) {
        // Конец текста в звездочках
        currentMap += part;
        maps.push(currentMap);
        currentMap = "";
        inStar = false;
      } else if (part.endsWith('*')) {
        // Текст заканчивается звездочкой
        currentMap += part;
        maps.push(currentMap);
        currentMap = "";
        inStar = false;
      } else {
        // Обычный текст, добавляем его
        maps.push(part);
      }
    }
    // Если остались не завершённые текущие данные, добавляем их
    if (currentMap) {
      maps.push(currentMap);
    }

    maps = maps.filter(item => item.trim() !== '');
    maps = maps.filter((item, index, self) => {
      const lowercaseItem = item.toLowerCase();
      return index === self.findIndex(otherItem => otherItem.toLowerCase() === lowercaseItem);
    });

    return maps;

  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления игровых карт Q2
bot.command('addmapq2', async (ctx) => {
  try {
    let maps = parseMap(ctx);
    console.log("maps=" + maps.join(", "));
    await addMaps(ctx, maps, 'q2');
  } catch (error) { console.log(`Ошибка: `, error); }
});

bot.command('amq2', async (ctx) => {
  try {
    let maps = parseMap(ctx);
    console.log("maps=" + maps.join(", "));
    await addMaps(ctx, maps, 'q2');
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для добавления игровых карт QW
bot.command('addmapqw', async (ctx) => {
  try {
    let maps = parseMap(ctx);
    console.log("maps=" + maps.join(", "));
    await addMaps(ctx, maps, 'qw');
  } catch (error) { console.log(`Ошибка: `, error); }
});

bot.command('amqw', async (ctx) => {
  try {
    let maps = parseMap(ctx);
    console.log("maps=" + maps.join(", "));
    await addMaps(ctx, maps, 'qw');
  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Вспомогательная функция для удаления игроков
async function delMap(ctx, map, game) {
  try {
    const userId = getUserID(ctx);
    const chatId = ctx.chat.id;

    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME;
    }

    let userSettings = await getUserSettings(userId);

    let existingMaps;
    if (game == 'q2') existingMaps = userSettings && userSettings.q2maps != undefined && userSettings.q2maps != '' ? userSettings.q2maps : [];
    if (game == 'qw') existingMaps = userSettings && userSettings.qwmaps != undefined && userSettings.qwmaps != '' ? userSettings.qwmaps : [];

    if (!map || map == undefined || map.trim() == '') {
      return ctx.reply(`Укажите название карты, которую вы хотите удалить из настроек ваших карт в игре ${config.GAMES_TITLES[game]}.\nВаши ${game} карты: ${existingMaps.join(', ')}`);
    }

    if (!existingMaps.includes(map.toLowerCase())) {
      return ctx.reply(`Карта ${map} не найдена в ваших настройках карт.\nВаши ${game} карты: ${existingMaps.join(', ')}`);
    }

    const updatedMaps = existingMaps.filter(p => p.toLowerCase() !== map.toLowerCase());
    let mapsLeft;
    if (game == 'q2') {
      await updateUserSettings(userId, { q2maps: updatedMaps });
      userSettings = await getUserSettings(userId);
      const q2maps = userSettings && userSettings.q2maps != undefined && userSettings.q2maps != '' ? userSettings.q2maps : [];
      mapsLeft = `${q2maps.length > 0 ? q2maps.join(', ') : 'нет - используйте /amq2'}`;
    }
    else if (game == 'qw') {
      await updateUserSettings(userId, { qwmaps: updatedMaps });
      userSettings = await getUserSettings(userId);
      const qwmaps = userSettings && userSettings.qwmaps != undefined && userSettings.qwmaps != '' ? userSettings.qwmaps : [];
      mapsLeft = `${qwmaps.length > 0 ? qwmaps.join(', ') : 'нет - используйте /amqw'}`;
    }

    ctx.reply(`Карта ${map} удалена.\nОстальные ${game} карты:\n${mapsLeft}`);

    userSettings = await getUserSettings(userId);
    /* if ((userSettings.q2servers === undefined || userSettings.q2servers.join("").trim() === '') && (userSettings.players === undefined || userSettings.players.join("").trim() === '')) {
       await updateUserSettings(userId, { timer: 0 });
       stopAutoSearch(userId);
       ctx.reply(`Игроков и серверов для мониторинга больше нет, поэтому таймер обновления сброшен на 0, автообновление выключено.`);
     } */
  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления игроков
bot.command('delmapq2', async (ctx) => {
  try {
    const map = ctx.message.text.split(' ')[1];
    await delMap(ctx, map, 'q2');
  } catch (error) {
    console.log(`Ошибка: `, error);
  }
});

bot.command('dmq2', async (ctx) => {
  try {
    const map = ctx.message.text.split(' ')[1];
    await delMap(ctx, map, 'q2');
  } catch (error) {
    console.log(`Ошибка: `, error);
  }
});

bot.command('delmapqw', async (ctx) => {
  try {
    const map = ctx.message.text.split(' ')[1];
    await delMap(ctx, map, 'qw');
  } catch (error) {
    console.log(`Ошибка: `, error);
  }
});

bot.command('dmqw', async (ctx) => {
  try {
    const map = ctx.message.text.split(' ')[1];
    await delMap(ctx, map, 'qw');
  } catch (error) {
    console.log(`Ошибка: `, error);
  }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления всего
bot.command('delall', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    await updateUserSettings(userId, { players: [] });
    await updateUserSettings(userId, { q2servers: [] });
    await updateUserSettings(userId, { q2maps: [] });
    await updateUserSettings(userId, { qwservers: [] });
    await updateUserSettings(userId, { qwmaps: [] });
    await updateUserSettings(userId, { playersFilter: [] });
    await updateUserSettings(userId, { games: [] });

    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    await ctx.reply('Все ваши игроки, сервера и карты удалены.');

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      await ctx.reply(`Игр или игроков и серверов для мониторинга больше нет, поэтому мониторинг отключён.`);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления всех игроков
bot.command('delallp', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    await updateUserSettings(userId, { players: [] });
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    await ctx.reply('Все ваши игроки удалены.');

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      await ctx.reply(`Игр или игроков и серверов для мониторинга больше нет, поэтому мониторинг отключён.`);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления всех фильтров игроков
bot.command('delallpf', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    await updateUserSettings(userId, { playersFilter: [] });
    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    ctx.reply('Все ваши фильтры игроков удалены.');

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      ctx.reply(`Игр или игроков и серверов для мониторинга больше нет, поэтому поэтому мониторинг отключён.`);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления всех серверов
bot.command('delalls', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    await updateUserSettings(userId, { q2servers: [] });
    await updateUserSettings(userId, { qwservers: [] });

    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    ctx.reply('Все ваши сервера удалены.');

    if (!await checkCanTimer(userId)) {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      ctx.reply(`Игра или игроков и серверов для мониторинга больше нет, поэтому мониторинг отключён.`);
    }

  } catch (error) { console.log(`Ошибка: `, error); }
});


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для удаления всех карт
bot.command('delallm', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    await updateUserSettings(userId, { q2maps: [] });
    await updateUserSettings(userId, { qwmaps: [] });

    const chatId = ctx.chat.id;
    await updateUserSettings(userId, { chatId: chatId });
    ctx.reply('Все ваши карты удалены.');
    userSettings = await getUserSettings(userId);

  } catch (error) { console.log(`Ошибка: `, error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function info(ctx) {
  try {
    const userId = getUserID(ctx);
    const userSettings = await getUserSettings(userId) || {};

    const games = userSettings.games || [];
    const gamesTitles = games.map(game => config.GAMES_TITLES[game]);
    const players = userSettings.players || [];
    const playersFilter = userSettings.playersFilter || [];
    let sparr = userSettings.spFilter || [];
    //console.log(sparr);
    sp = formatServers(sparr);
    //console.log('sp=' + sp);
    const q2servers = userSettings.q2servers || [];
    const q2maps = userSettings.q2maps || [];
    const qwservers = userSettings.qwservers || [];
    const qwmaps = userSettings.qwmaps || [];
    const timer = userSettings.timer && userSettings.timer !== undefined ? userSettings.timer : 'не установлен';
    let timerEnabled = userSettings.timerEnabled && userSettings.timerEnabled !== undefined ? userSettings.timerEnabled : 0;
    timerEnabled = timerEnabled == 1 ? "разрешён" : "не разрешён";

    const sleepTime = userSettings.sleepTime && userSettings.sleepTime !== undefined && userSettings.sleepTime.trim() != '' ? userSettings.sleepTime : 'не установлено';
    const isBanned = userSettings.banned || 'Нет';
    const isOwner = userId === config.OWNER_ID || false;
    var Message = `🎮Ваши игры: ${games.length > 0 ? games.join(', ') + ' (' + gamesTitles.join(', ') + ')' : 'не определны - используйте /ag'}.\n\n`;
    Message += `🕵️ Ваши игроки: ${players.length > 0 ? '\n' + players.join(', ') : 'нет - используйте /ap'}.

🕵️ Ваш фильтр игроков: ${playersFilter.length > 0 ? '\n' + playersFilter.join(', ') : 'нет - используйте /apf'}.

🖥️🕵️ Ваш фильтр сервер-игрок: ${sp.trim() != '' ? '\n' + sp : 'нет - используйте /aspf'}.

🖥️ Ваши Q2 сервера: ${q2servers.length > 0 ? '\n' + q2servers.join(', ') : 'нет - используйте /asq2'}.

🏝️ Ваши Q2 карты: ${q2maps.length > 0 ? '\n' + q2maps.join(', ') : 'нет - используйте /amq2'}

🖥️ Ваши QW сервера: ${qwservers.length > 0 ? '\n' + qwservers.join(', ') : 'нет - используйте /asqw'}.

🏝️ Ваши QW карты: ${qwmaps.length > 0 ? '\n' + qwmaps.join(', ') : 'нет - используйте /amqw'}

〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️

🔍 Интервал обновления: ${timer} секунд(ы).
👁️ Мониторинг: ${timerEnabled}.
🕓 Управлять: /timer

💤 Время сна: ${sleepTime}.
Управлять: /st

〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
`;

    let advmode = userSettings.advmode;
    if (advmode == undefined || advmode === 0) {
      Message += '📚 Расширенный режим: выключен.\nУправлять: /am';
    } else {
      Message += '\n\n📚 Расширенный режим: включён.\nУправлять: /am\nТекущее Значение: ' + advmode;
    }

    let advcontrols = userSettings.advcontrols;
    if (advcontrols === undefined || advcontrols === 0) {
      Message += '\n\n🈁 Отображение кнопок в результатах поиска: выключено.\nВключить: /ac 1';
    } else {
      Message += '\n\n🈁 Отображение кнопок в результатах поиска: включено.\nОтключить: /ac 0';
    }

    let altview = userSettings.altview;
    if (altview === undefined || altview === 0) {
      Message += '\n\n💡Альтернативный (компактный) режим отображения информации: выключен.\nВключить: /av 1';
    } else {
      Message += '\n\n💡Альтернативный (компактный) режим отображения информации: включено.\nОтключить: /av 0';
    }

    let autodelhistory = userSettings.autodelhistory;
    if (autodelhistory === undefined || autodelhistory === 0) {
      Message += '\n\n🗑️ Автоматическое удаление предыдущих сообщений о найденных игроках / серверах: выключено.\nВключить: /adh 1';
    } else {
      Message += '\n\n🗑️ Автоматическое удаление предыдущих сообщений о найденных игроках / серверах: включено.\nОтключить: /adh 0';
    }

    let heuristic = userSettings.heuristic;
    if (heuristic === undefined || heuristic === 0) {
      Message += '\n\n🧊 Эвристический анализ: выключен.\nВключить: /hm 1';
    } else {
      Message += '\n\n🧊 Эвристический анализ: включен.\nОтключить: /hm 0';
    }

    let minPlayers = userSettings.minPlayers;
    if (minPlayers == undefined) minPlayers = 1;
    if (minPlayers === 0) {
      Message += '\n\n🖥️ Фильтрация серверов по минимальному количеству игроков: выключена.\nУправлять: /mp';
    } else {
      Message += '\n\n🖥️ Фильтрация серверов по минимальному количеству игроков: включена.\nУправлять: /mp\nТекущее значение: ' + String(minPlayers);
    }

    let minPS = userSettings && userSettings.minplayerscore != undefined ? userSettings.minplayerscore : 0;
    if (minPS === 0) {
      Message += '\n\n🖥️ Фильтрация поиска игрока по минимальному количеству его очков на сервере: выключена.\nУправлять: /mps';
    } else {
      Message += '\n\n🖥️ Фильтрация поиска игрока по минимальному количеству его очков на сервере: включена.\nУправлять: /mps\nТекущее значение: ' + String(minPS);
    }

    let botFilter = userSettings.botFilter;
    if (botFilter === undefined) botFilter = 1;
    if (botFilter === 0) {
      Message += '\n\n✖️ Фильтрация серверов по ботам: выключена';
    } else {
      Message += '\n\n✖️ Фильтрация серверов по ботам: вкючена';
    }

    Message += `

    〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
    
  ⚠️ Статус вашей блокировки в боте:  ${isBanned}

  Версия бота: ${config.VERSION}
       
    `;

    if (isOwner) Message = `✅  Вы - владелец бота.\n\n` + Message;
    //"⚠️ SELL" : "✅  BUY"
    try {
      ctx.reply(Message);
    }
    catch (error) { console.log(`Ошибка: `, error) };

  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для получения информации о игроках
bot.command('info', async (ctx) => {
  try {
    await info(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
});

bot.command('i', async (ctx) => {
  try {
    await info(ctx);
  } catch (error) { console.log(`Ошибка: `, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function timer(ctx) { //функция для установки таймера
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    let userSettings = await getUserSettings(userId) || {};
    const timerValue = parseInt(ctx.message.text.split(' ')[1]);
    const timer = userSettings.timer !== undefined ? userSettings.timer : 'не установлен';
    if (isNaN(timerValue) || timerValue < 0 || (timerValue > 0 && timerValue < config.MIN_TIMER)) {
      return ctx.reply(`Укажите положительное значение таймера от ${config.MIN_TIMER} секунд(ы) или больше, или 0 для отключения.\nТекущее значение: ${timer}.`);
    }
    let prevTimerEnabled = userSettings.timerEnabled;
    prevTimerEnabled = (!prevTimerEnabled || prevTimerEnabled == undefined || prevTimerEnabled == '' || prevTimerEnabled == 0) ? 0 : prevTimerEnabled;

    await updateUserSettings(userId, { timer: timerValue });
    ctx.reply(`🕓 Таймер установлен на ${timerValue} секунд(ы).`);

    if (timerValue > 0) {
      userSettings = await getUserSettings(userId);
      if (!await checkCanTimer(userId)) {
        await updateUserSettings(userId, { timerEnabled: 0 });
        await stopAutoSearch(userId);
        //return await bot.telegram.sendMessage(ctx.chat.id, 'Вначале внесите настройки для поиска: \n - установите игры командой /ag\n - добавьте игроков для остлеживания командой /ap и/или сервера командами /asq2 и /asqw)\nПри желании установите период неактивности для мониторинга командой /st\nЗатем повторите включение таймера.\nВаши настройки: /i');
        return await ctx.reply('Вначале внесите настройки для поиска: \n - установите игры командой /ag\n - добавьте игроков для остлеживания командой /ap и/или сервера командами /asq2 и /asqw)\nПри желании установите период неактивности для мониторинга командой /st\nЗатем повторите включение таймера.\nВаши настройки: /i');
      }
      else {
        await updateUserSettings(userId, { timerEnabled: 1 });
        await updateUserSettings(userId, { timer: timerValue });
        await stopAutoSearch(userId); //на всякий случай
        await startAutoSearch(userId, timerValue);
        if (prevTimerEnabled == 0) ctx.reply(`👁️ Мониторинг включён.\nТекущий таймер обновления: ${userSettings.timer}\nВаши настройки: /i\nЕсли вы хотите отключить мониторинг, воспользуйтесь командой 🕓 /timer 0`);
      }
    } else {
      await updateUserSettings(userId, { timerEnabled: 0 });
      await stopAutoSearch(userId);
      if (prevTimerEnabled == 1) ctx.reply(`👁️ Мониторинг отключён.\nМониторинг будет автоматически восстановлен в случае если вы добавите новые настройки для мониторинга и включите таймер.\n/help для информации.`);
    }

  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки таймера
bot.command('timer', async (ctx) => {
  try {
    await timer(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('t', async (ctx) => {
  try {
    await timer(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function advMode(ctx) { //вспомогательная функция для установки advmode
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let advmode = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(advmode) || advmode < 0 || (advmode > 3)) {
      userSettings = await getUserSettings(userId);
      advmode = userSettings && userSettings.advmode != undefined ? userSettings.advmode : 0;
      return ctx.reply('Укажите корректное значение параметра:\n0 - отключено\n1 - отображение только дополнительной информации о текущем счете и других игроках\n2 - отображение только дополнительной информации о параметрах сервера\n3 - отображение всей дополнительной информации.\n\nТекущее значение: ' + advmode);
    }

    await updateUserSettings(userId, { advmode: advmode });
    userSettings = await getUserSettings(userId);
    advmode = userSettings.advmode;
    if (advmode > 0) {
      return ctx.reply('📚 Расширенный режим отображения информации: ВКЛЮЧЁН.');
    } else {
      return ctx.reply('📚 Расширенный режим отображения информации: ВЫКЛЮЧЕН.');
    }


  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки расширенного режима отображения информации
bot.command('advmode', async (ctx) => {
  try {
    await advMode(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('am', async (ctx) => {
  try {
    await advMode(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function advControls(ctx) { //вспомогательная функция для установки advcontrols
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let advcontrols = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(advcontrols) || advcontrols < 0 || (advcontrols > 1)) {
      userSettings = await getUserSettings(userId);
      advcontrols = userSettings && userSettings.advcontrols != undefined ? userSettings.advcontrols : 0;
      return ctx.reply('Укажите корректное значение параметра:\n0 - отключено\n1 - отображение дополнительных кнопок под окном результата поиска.\n\nТекущее значение: ' + advcontrols);
    }

    await updateUserSettings(userId, { advcontrols: advcontrols });
    userSettings = await getUserSettings(userId);
    advcontrols = userSettings.advcontrols;
    if (advcontrols > 0) {
      return ctx.reply('🈁 Отображение дополнительных кнопок в окне результатов поиска: ВКЛЮЧЕНО.');
    } else {
      return ctx.reply('🈁 Отображение дополнительных кнопок в окне результатов поиска: ВЫКЛЮЧЕНО.');
    }


  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки расширенного режима отображения информации
bot.command('advcontrols', async (ctx) => {
  try {
    await advControls(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки расширенного режима отображения информации
bot.command('ac', async (ctx) => {
  try {
    await advControls(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function autoDelHistory(ctx) { //вспомогательная функция для установки autodelhistory
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let autodelhistory = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(autodelhistory) || autodelhistory < 0 || (autodelhistory > 1)) {
      userSettings = await getUserSettings(userId);
      autodelhistory = userSettings && userSettings.autodelhistory != undefined ? userSettings.autodelhistory : 0;
      return ctx.reply('Укажите корректное значение параметра:\n0 - отключено\n1 - автоматическое удаление предыдущих сообщений о найденных игроках / серверах.\n\nТекущее значение: ' + autodelhistory);
    }

    await updateUserSettings(userId, { autodelhistory: autodelhistory });
    userSettings = await getUserSettings(userId);
    autodelhistory = userSettings.autodelhistory;
    if (autodelhistory > 0) {
      return ctx.reply('Автоматическое удаление предыдущих сообщений о найденных игроках / серверах: ВКЛЮЧЕНО.');
    } else {
      return ctx.reply('Автоматическое удаление предыдущих сообщений о найденных игроках / серверах: ВЫКЛЮЧЕНО.');
    }


  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('autodelhistory', async (ctx) => {
  try {
    await autoDelHistory(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки расширенного режима отображения информации
bot.command('adh', async (ctx) => {
  try {
    await autoDelHistory(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function altViewSetup(ctx) { //вспомогательная функция для установки altview
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let altview = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(altview) || altview < 0 || (altview > 1)) {
      userSettings = await getUserSettings(userId);
      altview = userSettings && userSettings.altview != undefined ? userSettings.altview : 0;
      return ctx.reply('Укажите корректное значение параметра:\n0 - стандартное отображение информации\n1 - альтернативное (компактное).\n\nТекущее значение: ' + altview);
    }

    await updateUserSettings(userId, { altview: altview });
    userSettings = await getUserSettings(userId);
    altview = userSettings.altview;
    if (altview > 0) {
      return ctx.reply('Альтернативное (компактное) отображение информации: ВКЛЮЧЕНО.');
    } else {
      return ctx.reply('Альтернативное (компактное) отображение информации: ВЫКЛЮЧЕНО.');
    }


  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки расширенного режима отображения информации
bot.command('altview', async (ctx) => {
  try {
    await altViewSetup(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки расширенного режима отображения информации
bot.command('av', async (ctx) => {
  try {
    await altViewSetup(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function heuristicMode(ctx) { //вспомогательная функция для установки altview
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let heuristic = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(heuristic) || heuristic < 0 || (heuristic > 1)) {
      userSettings = await getUserSettings(userId);
      heuristic = userSettings && userSettings.heuristic != undefined ? userSettings.heuristic : 0;
      return ctx.reply('Укажите корректное значение параметра:\n0 - стандартное\n1 - эвристический анализ (базовая версия).\n\nТекущее значение: ' + heuristic);
    }

    await updateUserSettings(userId, { heuristic: heuristic });
    userSettings = await getUserSettings(userId);
    heuristic = userSettings.heuristic;
    if (heuristic > 0) {
      return ctx.reply('🧊 Эвристический анализ: ВКЛЮЧЕН.');
    } else {
      return ctx.reply('🧊 Эвристический анализ: ВЫКЛЮЧЕН.');
    }


  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки эвристического поиска
bot.command('heuristicmode', async (ctx) => {
  try {
    await heuristicMode(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки эвристического поиска
bot.command('hm', async (ctx) => {
  try {
    await heuristicMode(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function minPlayerScore(ctx) { //вспомогательная функция для установки altview
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let minPS = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(minPS)) {
      userSettings = await getUserSettings(userId);
      minPS = userSettings && userSettings.minplayerscore != undefined ? userSettings.minplayerscore : 0;
      return ctx.reply(`Укажите корректное значение параметра:

➡️ 0 : не учитывать минимальное количество очков в поиске игрока.
➡️ 1 и больше : учитывать (на указанное число). К примеру, если вы указали 2, то игрок попадёт в мониторинг только в том случае, если счёт его фрагов от 2 и больше.
➡️ -1 и меньше : учитывать на указанное число + фильтрация нулевого счета. К примеру, если вы указали -1, то игрок попадёт в мониторинг только в случае, если у него -1 фрагов или больше, но если у него будет меньше -1 или 0 , то не попадёт.

 🗃️ Текущее значение: ${minPS}`);
    }

    await updateUserSettings(userId, { minplayerscore: minPS });
    userSettings = await getUserSettings(userId);
    minPS = userSettings.heuristic;
    if (minPS > 0) {
      return ctx.reply('🕵️ Учёт минимального количества очков в поиске игрока:  ВКЛЮЧЕНО.');
    } else {
      return ctx.reply('🕵️ Учёт минимального количества очков в поиске игрока:  ВЫКЛЮЧЕНО.');
    }


  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки минимального счёта игрока для поиска
bot.command('minplayerscore', async (ctx) => {
  try {
    await minPlayerScore(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки минимального счёта игрока для поиска
bot.command('mps', async (ctx) => {
  try {
    await minPlayerScore(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function minPlayers(ctx) { //функция для установки минимального кол-ва игроков
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let minPlayers = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(minPlayers) || minPlayers < 0 || (minPlayers > config.SERVER_MIN_PLAYERS)) {
      userSettings = await getUserSettings(userId);
      minPlayers = userSettings && userSettings.minPlayers != undefined ? userSettings.minPlayers : 1;
      return ctx.reply(`Укажите корректное значение параметра:\n0 - отключено\n1 ... ${config.SERVER_MIN_PLAYERS} включение сервера в поиск только в случае, если на нём присутствует не менее заданного числа игроков.\nИспользуйте команду /botfilter 1 если хотите исключить из анализа ботов типа WallFly\nТекущее значение: ${minPlayers}`);
    }

    await updateUserSettings(userId, { minPlayers: minPlayers });
    userSettings = await getUserSettings(userId);
    minPlayers = userSettings.minPlayers;
    if (minPlayers > 0) {
      return ctx.reply('Фильтрация серверов по минимальному количеству игроков: ВКЛЮЧЕНА');
    } else {
      return ctx.reply('Фильтрация серверов по минимальному количеству игроков: ВЫКЛЮЧЕНА.');
    }
  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки минимального кол-ва игроков для фильтрации при поиске сервером (не влияет при поиске по игрокам)
bot.command('minplayers', async (ctx) => {
  try {
    await minPlayers(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('mp', async (ctx) => {
  try {
    await minPlayers(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function botFilter(ctx) { //функция для установки режима фильтрации в поиске серверов где имеются только боты типа wallfly
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let botFilter = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (isNaN(botFilter) || botFilter < 0 || (botFilter > 1)) {
      userSettings = await getUserSettings(userId);
      botFilter = userSettings && userSettings.botFilter != undefined ? userSettings.botFilter : 1;
      return ctx.reply('Укажите корректное значение параметра:\n0 - отключено, 1 - включено\nИспользуйте /botfilter 1 если хотите исключить из анализа ботов типа WallFly (влияет только при поиске серверов в паре с командой \minplayers.\nТекущее значение: ' + botFilter);
    }

    await updateUserSettings(userId, { botFilter: botFilter });
    userSettings = await getUserSettings(userId);
    botFilter = userSettings.botFilter;
    if (botFilter > 0) {
      return ctx.reply('Фильтрация ботов: ВКЛЮЧЕНА');
    } else {
      return ctx.reply('Фильтрация ботов: ВЫКЛЮЧЕНА.');
    }


  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки режима фильтрации в поиске серверов где имеются только боты типа wallfly
bot.command('botfilter', async (ctx) => {
  try {
    await botFilter(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('bf', async (ctx) => {
  try {
    await botFilter(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.command('setbotfilter', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }
    //console.log("1");
    let botSettings = await getUserSettings(0);
    //console.log("2");
    //let botFilter = botSettings && botSettings.botFilter ? botSettings.botFilter : ""; 
    //console.log('botFilter='+botFilter);
    let botFilter = prepareParam(ctx);//ctx.message.text.split(' ')[1];
    if (!botFilter || botFilter === undefined || botFilter.lenght == 0 || botFilter.join('') == '') {
      botSettings = await getUserSettings(0);
      botFilter = botSettings && botSettings.botFilter != undefined ? botSettings.botFilter : [];
      return ctx.reply('Укажите корректное значение параметра.\nТекущее значение: ' + botFilter.join(', '));
    }
    console.log('botFilter=' + botFilter.join(', '));
    await updateUserSettings(0, { botFilter: botFilter });
    //console.log('botFilter1');
    //console.log('botFilter='+botFilter);
    botSettings = await getUserSettings(0);
    botFilter = botSettings && botSettings.botFilter ? botSettings.botFilter : [];
    ctx.reply(`Фильтр установлен.\nТекущее значение: ${botFilter.join(', ')}.`);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда /unban <userID>
bot.command('unban', async (ctx) => {
  try {
    if (!await isAdmin(ctx.from.id)) {
      return ctx.reply('У вас нет прав для использования этой команды.');
    }

    const userId = ctx.message.text.split(' ')[1];
    await unbanUser(userId); // Предполагается, что функция реализована в db.js
    ctx.reply(`Пользователь с ID ${userId} разблокирован.`);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function isValidTimeRange(timeRange) {
  // Регулярное выражение для проверки формата
  const timePattern = /^\d{2}:\d{2}-\d{2}:\d{2}$/;

  // Проверяем, соответствует ли строка паттерну
  if (!timePattern.test(timeRange)) {
    return false;
  }

  // Разделяем строку на начало и конец
  const [startTime, endTime] = timeRange.split('-');

  // Проверяем валидность времени (часы от 00 до 23, минуты от 00 до 59)
  const isValidTime = (time) => {
    const [hours, minutes] = time.split(':').map(Number);
    return hours >= 0 && hours < 24 && minutes >= 0 && minutes < 60;
  };

  // Преобразуем время в минуты для сравнения
  const timeToMinutes = (time) => {
    const [hours, minutes] = time.split(':').map(Number);
    return hours * 60 + minutes;
  };

  const start = timeToMinutes(startTime);
  const end = timeToMinutes(endTime);

  // Возвращаем true, если времена корректны
  return isValidTime(startTime) && isValidTime(endTime);
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function sleepTime(ctx) { //функция для установки времени сна
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя
    let userSettings = await getUserSettings(userId);

    const sleepTime = ctx.message.text.split(' ')[1];

    const curSleepTime = userSettings && userSettings.sleepTime && userSettings.sleepTime !== undefined ? userSettings.sleepTime : 'не установлено';

    if (sleepTime == undefined || sleepTime.trim() == '') {
      return ctx.reply(`Укажите корректно время сна в формате /sp <hh:mm-hh2:mm2>, например: /sp 23:00-09:00, либо /sp 0 для сброса параметра.\nТекущее значение: ${curSleepTime}`);
    }
    else if (sleepTime.trim() == '0') {
      await updateUserSettings(userId, { sleepTime: '' });
      ctx.reply(`Время сна отключено`);
    }
    else if (!isValidTimeRange(sleepTime)) {
      return ctx.reply(`Укажите корректно время сна в формате /sp <hh:mm-hh2:mm2>, например: /sp 23:00-09:00, либо /sp 0 для сброса параметра\nТекущее значение: ${curSleepTime}`);
    }
    else {
      await updateUserSettings(userId, { sleepTime });
      ctx.reply(`Время сна установлено: ${sleepTime}`);
    }



  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки времени сна
bot.command('sleeptime', async (ctx) => {
  try {
    await sleepTime(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('st', async (ctx) => {
  try {
    await sleepTime(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function refreshPlayers(userId, searchFor, game, msgIdToDel, skipStatusMsg, forceUpdate) {
  let wasFinded = false;
  try {
    log('refreshPlayers, ', msgIdToDel);
    if (typeof searchFor === 'undefined') {
      searchFor = ''; // Установите значение по умолчанию, если searchFor не указан
    }
    //console.log('searchFor = ' + searchFor);
    searchFor = normalName(searchFor);//.trim());

    let canPostNotFinded = true;
    if (searchFor == undefined || searchFor == '') canPostNotFinded = false;

    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME;
    }
    //console.log('game = ' + game);
    game = game.trim();

    if (typeof msgIdToDel === 'undefined') {
      msgIdToDel = '0'; // Установите значение по умолчанию, если msgIdToDel не указан
    }

    if (typeof skipStatusMsg === 'undefined') {
      skipStatusMsg = false; // Установите значение по умолчанию, если skipStatusMsg не указан
    }

    if (typeof forceUpdate === 'undefined') {
      forceUpdate = false; // Установите значение по умолчанию, если forceUpdate не указан
    }

    const userSettings = await getUserSettings(userId);

    if (searchFor === '' && (!userSettings || userSettings === undefined || userSettings.players === undefined)) {
      //const ctx = userContexts[userId];
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Вначале внесите настройки для поиска (/addplayer).');
      return;
    }

    let players;

    if (searchFor != '') {
      players = [];
      players[0] = searchFor;
    } else {
      players = userSettings ? userSettings.players : [];
    }

    const playersFilter = userSettings && userSettings.playersFilter != undefined ? userSettings.playersFilter : []; //глобальный фильтр игрока
    const spFilter = userSettings && userSettings.spFilter != undefined ? userSettings.spFilter : []; //фильтр сервер - игрок

    const chatId = userSettings ? userSettings.chatId : null; // Получаем chatId из настроек пользователя
    const themeId = userSettings ? userSettings.themeId : null; // Получаем themeId из настроек пользователя
    //console.log('chatId = ' + userSettings.chatId + ', ' + players.join(', '));

    const isBanned = userSettings && userSettings.banned && userSettings.banned != undefined ? userSettings.banned : false;
    if (isBanned !== false) {
      if (!themeId) return await bot.telegram.sendMessage(chatId, 'Вы забанены для поиска пользователей.');
      else return await bot.telegram.sendMessage(chatId, 'Вы забанены для поиска пользователей.', { message_thread_id: themeId });
    }

    if (!chatId) {
      console.log('chatId не найден для пользователя ', userId);
      return;
    }

    if (searchFor === '' && (!players || players.length === 0)) {
      //console.log(`У пользователя ${userId} нет добавленных игроков.`);
      return; //bot.telegram.sendMessage(chatId, 'У вас нет добавленных игроков для осуществления поиска.\nДобавьте игроков через комнаду /addplayer.\nВоспользуйтесь командой /help для полного руководства по пользованию ботом.');
    }

    const advmode = userSettings.advmode || 0;
    const altview = userSettings && userSettings.altview && userSettings.altview != undefined ? userSettings.altview : 0;
    const heuristic = userSettings && userSettings.heuristic && userSettings.heuristic != undefined ? userSettings.heuristic : 0;
    const minPS = userSettings && userSettings.minplayerscore != undefined ? userSettings.minplayerscore : 0;

    /*  if (advmode === undefined || advmode === 0) {
        Message += '\nРасширенный режим: выключен.';      
      } else {
        Message += '\nРасширенный режим: включён.';  
      }
    */
    //console.log('const serverList = await getServerListQ2(); - START');
    let serverList = '';
    //if (game == 'q2') serverList = await getServerListQ2();
    //else if (game == 'qw') serverList = await getServerListQW();

    /*
    if (searchFor == '') serverList = await getServerList(game);
    else serverList = await getServerListFromCache(game);
    */
    //serverList = await getServerList(game);
    serverList = await getServerListFromCache(game);
    //console.log('const serverList = await getServerListQ2(); - FINISH');

    // Берём снимок кэша серверов для текущей игры на момент старта поиска
    const cacheSnapshot = (typeof globalServerCache !== 'undefined' && globalServerCache[game])
      ? globalServerCache[game]
      : null;

    //const addedPlayers = [];
    let serverInfoString = "";
    let playersInfoString = "";
    let serverPlayersTmp;
    let foundPlayers = [];
    //console.log('Анализ информации, полученной из серверов...');
    const promises = serverList.map(async (server) => {
      const [ip, port] = server.split(':');
      try {
        //console.log('const { players: serverPlayers, serverInfo } = await queryServerQ2(ip, port); - START');
        let serverPlayers;
        let serverInfo;
        /*if (game == 'q2') {
          ({ players: serverPlayers, serverInfo } = await queryServerQ2(ip, port));
        } else if (game == 'qw') {
          ({ players: serverPlayers, serverInfo } = await queryServerQW(ip, port));
        }*/

        /*
        if (searchFor == '') {
          ({ serverPlayers, serverInfo } = await queryServer(game, ip, port));
        }
        else {
          ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));
        }
        */
        //({ serverPlayers, serverInfo } = await queryServer(game, ip, port));

        // - 29.11.2025 ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));

        // Сначала пробуем взять данные из глобального кэша,
        // если нет записи — делаем живой запрос, как раньше.
        const cacheKey = `${ip}:${port}`;
        const cacheEntry = cacheSnapshot ? cacheSnapshot[cacheKey] : null;

        if (cacheEntry) {
          serverPlayers = Array.isArray(cacheEntry.serverPlayers) ? cacheEntry.serverPlayers : [];
          serverInfo = cacheEntry.serverInfo || {};
        } else {
          ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));
        }

        serverPlayersTmp = serverPlayers.map(item => ({ ...item }));
        serverPlayers.forEach(p => {
          if (p && p.name != undefined) {

            let isMPSFiltered = false;
            if (searchFor == '') {
              if (minPS > 0 && (isNaN(p.score) || parseInt(p.score) < minPS)) isMPSFiltered = true;
              else if (minPS < 0 && (isNaN(p.score) || parseInt(p.score) == 0 || parseInt(p.score) < minPS)) isMPSFiltered = true;
            }

            let isSPFiltered = false;

            if (!isMPSFiltered) {
              for (i = 0; i < spFilter.length; i++) {
                //let cur = server + `\\` + normalName(p.name);
                const sp = spFilter[i].split('\\');
                if (matchServer(sp[0], server) && matchPlayer(sp[1], normalName(p.name.toLowerCase()))) {
                  isSPFiltered = true;
                  break;
                }
              }
            }

            if (isMPSFiltered) {
              // пропуск - игрок профильтрован по минимальному количеству фрагов!  
              log('Сработал фильтр минимального количества очков игрока');
            }
            else if (playersFilter.some(player => matchPlayer(player, normalName(p.name.toLowerCase())))) {
              // пропуск - игрок профильтрован глобально!  
              log('Сработал фильтр игрока');
            }
            else if (isSPFiltered) {
              // пропуск - игрок профильтрован на сервере!  
              log('Сработал фильтр сервер - игрок', spFilter);
            }
            else if (foundPlayers.some(foundPlayer => foundPlayer.name === normalName(p.name) && (foundPlayer.server === serverInfo['serverIp'] + ":" + serverInfo['serverPort']))) {
              // пропуск - игрок уже есть в списке этом сервере!   
              log('Игрок с таким именем уже имеется на этом сервере, второй раз не добавляем: ' + normalName(p.name));
            }
            else if (players.some(player => matchPlayer(formatName(normalName(player)), formatName(normalName(p.name.toLowerCase()))))) {
              log('Найден игрок ' + p.name);
              //console.log(serverInfo);

              let heuristicCanAddPlayer = true;
              if (heuristic == 1) {
                const previousScores = heuristicHistoryScores[userId + server + normalName(p.name)] && heuristicHistoryScores[userId + server + normalName(p.name)] != undefined ? heuristicHistoryScores[userId + server + normalName(p.name)] : 0;

                let scoresSum = 0;
                for (i = 0; i < serverPlayers.length; i++) {
                  try {
                    let ss = parseInt(serverPlayers[i].score);
                    if (isNaN(ss)) ss = 0;
                    scoresSum += ss;
                  }
                  catch (error) { };
                }
                log('forceUpdate=', forceUpdate);
                //if (previousScores == 0) { //пока оставим эвристику работать только если эвристика запускается первый раз или у в эвристике зафиксировано, что у всех игроков 0 фрагов 
                if (!forceUpdate && previousScores == scoresSum) {
                  heuristicCanAddPlayer = false;
                }
                //}
                if (serverPlayers.length > 0) { //Обновляем только если есть игроки на сервере
                  heuristicHistoryScores[userId + server + normalName(p.name)] = scoresSum;
                }
              }

              if (heuristicCanAddPlayer) {

                if (advmode > 1 && serverInfoString === '') {  // если расширенный режим = 2 или 3 то включаем доп инфу о сервере
                  for (const key in serverInfo) {
                    serverInfoString += `${key}: ${serverInfo[key]}, `;
                  }

                  // Удаление последнего лишнего пробела и запятой
                  serverInfoString = '\n<b>ИНФОРМАЦИЯ О СЕРВЕРЕ</b>\n' + normalNameHard(serverInfoString.slice(0, -2));
                  //console.log(serverInfoString);
                }
                log('Заполнение инфы об игроках на сервере.');
                //console.log(serverPlayers);
                if (advmode === 1 || advmode === 3) {  // если расширенный режим = 1 или 3 то включаем доп инфу об игроках
                  if (advmode === 1) playersInfoString = '\n<b>ИНФОРМАЦИЯ ОБ ИГРОКАХ</b>\n';
                  else playersInfoString = '\n\n<b>ИНФОРМАЦИЯ ОБ ИГРОКАХ</b>\n'; // добавляем еще один перенос строки если сверху отображается инфа о сервере

                  //serverPlayersTmp.sort((a, b) => b.score - a.score); //сортируем по счёту
                  serverPlayersTmp.sort((a, b) => {
                    // Сначала сравниваем, если оба score - числа
                    if (!isNaN(a.score) && !isNaN(b.score)) {
                      return parseInt(b.score, 10) - parseInt(a.score, 10); // Сортировка по убыванию чисел
                    } else if (!isNaN(a.score) && isNaN(b.score)) {
                      return -1; // Число больше, чем Spectator
                    } else if (isNaN(a.score) && !isNaN(b.score)) {
                      return 1; // Spectator меньше, чем число
                    } else {
                      return 0; // Оба Spectator - не сравниваем
                    }
                  });
                  //console.log(serverPlayersTmp);
                  log('altview=', altview);
                  serverPlayersTmp.forEach(player => {
                    if (altview == 0) {
                      playersInfoString += `\n <a href='https://www.gametracker.com/player/${normalNameHard(player.name).trim()}/${serverInfo['serverIp'] + ":" + serverInfo['serverPort']}/'>🔍</a> ${normalNameHard(player.name)}`;
                      playersInfoString += `\n Счет: ${player.score}`;
                      playersInfoString += `\n Пинг: ${player.ping}`;
                      playersInfoString += `\n -------------------`;
                    }
                    else {
                      playersInfoString += `\n ${player.score}  | ${normalName(player.name)} [${player.ping}]`;
                    }
                  });
                  //console.log(serverInfoString);
                  //console.log(serverPlayersTmp);
                  //console.log(serverPlayers);
                }

                log('Запись инфы о найденном игроке.');
                foundPlayers.push({
                  name: normalName(p.name),
                  nameFormatted: formatName(p.name),
                  ping: p.ping,
                  server: serverInfo['serverIp'] + ":" + serverInfo['serverPort'],
                  host: serverInfo['hostname'],
                  map: serverInfo['mapname'] && serverInfo['mapname'] != undefined ? serverInfo['mapname'] : 'нет (QTV/GTV/Specs room)',
                  serverInfo: serverInfoString,
                  playersInfo: playersInfoString,
                  playersList: serverPlayers.map(player => player.name).join(', ')
                });
                serverInfoString = "";
                //console.log(foundPlayers);
              }
              else {
                log('Пропуск по эвристике:', server + ' -> ' + normalName(p.name));
              }
            }
          }
        });
      } catch (error) {
        //log(`Ошибка при поиске игрока ${searchFor} - ${server}`, error);
      }
    });

    // Ждем, пока все промисы завершатся
    await Promise.allSettled(promises);

    log('foundPlayers.length=', foundPlayers.length);
    if (foundPlayers.length === 0) {
      //return bot.telegram.sendMessage(chatId, 'Игроки не найдены.');
    }

    let players2 = userSettings ? userSettings.players : [];
    let keyboard;
    let advcontrols = userSettings && userSettings.advcontrols && userSettings.advcontrols != undefined ? userSettings.advcontrols : 0;
    let autodelhistory = userSettings && userSettings.autodelhistory && userSettings.autodelhistory != undefined ? userSettings.autodelhistory : 0;
    let messageCount = 0;
    let messageCountAll = 0;
    const messagesPerSecond = config.MAX_MESSAGES_PER_SECOND;
    let serversAddCDF = ''; let serversDelCDF = ''; let serversUpdateCDF = ''; serversSearchMapCDF = ''; //для указания Callback функции-обработчика кнопох телеги
    let servers;
    let gameName;
    if (game == 'q2') {
      //console.log('game - q2');
      servers = userSettings && userSettings.q2servers ? userSettings.q2servers : [];
      serversAddCDF = 'addserverq2_';
      serversDelCDF = 'delserverq2_';
      serversUpdateCDF = 'updateserverq2_';
      serversSearchMapCDF = 'searchmapq2_';
      gameName = 'Quake II';
    }
    else if (game == 'qw') {
      //console.log('game - qw');
      servers = userSettings && userSettings.qwservers ? userSettings.qwservers : [];
      serversAddCDF = 'addserverqw_';
      serversDelCDF = 'delserverqw_';
      serversUpdateCDF = 'updateserverqw_';
      serversSearchMapCDF = 'sesearchmapqw_';
      gameName = 'QuakeWorld';

    }
    //console.log('Старт подготовки рассылки по найденным игрокам.');
    //foundPlayers.forEach(async (foundPlayer) => {
    for (i = 0; i < foundPlayers.length; i++) {
      //console.log('Sendmessage, playersInfoString='+playersInfoString);
      let foundPlayer = foundPlayers[i];
      log('foundPlayer=', foundPlayer);
      const q2ServerURL = `<a href='https://www.gametracker.com/server_info/${foundPlayer.server}/'>🔍</a> ${foundPlayer.server} `;
      const gameTrackerURL = `<a href='https://www.gametracker.com/player/${foundPlayer.name}/${foundPlayer.server}/'>GameTracker</a>`;
      let q2ServersURL;
      if (game == 'q2') {
        q2ServersURL = `<a href='http://q2servers.com/?mod=*&g=*&m=*&c=ru&ac=*&s=pd&player=${foundPlayer.name}&action=Search'>q2servers</a>`;
      }
      else if (game == 'qw') {
        q2ServersURL = ``;
      }

      let foundPlayer2 = includesPlayer(players2, foundPlayer.nameFormatted);
      let foundServer = includesServer(servers, foundPlayer.server);
      foundServer = foundServer === '' ? includesServer(servers, foundPlayer.server) : foundServer;
      //console.log('foundPlayer2=' + foundPlayer2);
      //console.log('nameOriginal=',foundPlayer.nameFormatted);

      if (advcontrols) {
        keyboard = {
          inline_keyboard: [
            [
              // { text: `Скопировать IP, url: 'https://t.me/share/url?url=${foundPlayer.server}'`},
              { text: `Обновить игрока`, callback_data: `updatePlayer_${game + '<<<<gameplayer>>>>' + foundPlayer.name}` },
              { text: `Обновить сервер`, callback_data: `${serversUpdateCDF}${foundPlayer.server}` },
            ]
          ]
        };

        let monitoringInlineKeyboard = [];


        if (foundPlayer2 && foundPlayer2.trim() != '') {
          monitoringInlineKeyboard.push({ text: `Не отслеживать игрока`, callback_data: `delPlayer_${foundPlayer2}` });
        } else {
          monitoringInlineKeyboard.push({ text: `Отслеживать игрока`, callback_data: `addPlayer_${foundPlayer.name}` });
        }
        if (foundServer && foundServer.trim() != '') {
          monitoringInlineKeyboard.push({ text: `Не отслеживать сервер`, callback_data: `${serversDelCDF}${foundPlayer.server}` });
        } else {
          monitoringInlineKeyboard.push({ text: `Отслеживать сервер`, callback_data: `${serversAddCDF}${foundPlayer.server}` });
        }
        keyboard.inline_keyboard.push(monitoringInlineKeyboard);

        let filterInlineKeyboard = [];
        filterInlineKeyboard.push({ text: `Игнорировать игрока ${foundPlayer.name} на этой этом сервере`, callback_data: `addSPFilter_${foundPlayer.server + '\\' + foundPlayer.name}` });
        keyboard.inline_keyboard.push(filterInlineKeyboard);

        let mapInlineKeyboard = [];
        mapInlineKeyboard.push({ text: `Найти все матчи на карте ${foundPlayer.map}`, callback_data: `${serversSearchMapCDF}${foundPlayer.map}` });
        keyboard.inline_keyboard.push(mapInlineKeyboard);

      }

      let message;
      if (altview == 0) {
        message = `Игрок ${foundPlayer.name} (пинг: ${foundPlayer.ping}) найден на сервере.
Игра: <b>${gameName}</b>
Сервер: ${q2ServerURL}
Название: ${foundPlayer.host}
Карта: <b>${foundPlayer.map}</b>
Игроки: ${normalNameHard(foundPlayer.playersList)}
Ссылки: ${q2ServersURL} ${gameTrackerURL}
${foundPlayer.serverInfo + foundPlayer.playersInfo}`;
      }
      else {
        message = `Информация по игроку <b>${foundPlayer.name}</b> [${foundPlayer.ping}] в игре <b>${gameName}</b> на сервере: ${q2ServerURL}
Название: ${foundPlayer.host}
Карта: <b>${foundPlayer.map}</b>
Игроки: ${normalName(foundPlayer.playersList)}
${foundPlayer.serverInfo + foundPlayer.playersInfo}`;
      }

      //const message = `Игрок ${foundPlayer.name} (пинг: ${foundPlayer.ping}) найден на сервере`;
      let previousMessageId;
      let previousMessageIdIndex;
      const chunks = message.match(/(.|[\n\r]){1,4096}/g);
      for (const chunk of chunks) {
        // console.log(chunk);
        try {
          //console.log(chunk);
          let sentMessage;

          if (!themeId) {
            if (advcontrols) sentMessage = await bot.telegram.sendMessage(chatId, chunk, { parse_mode: 'HTML', reply_markup: { inline_keyboard: keyboard.inline_keyboard, resize_keyboard: true } });
            else sentMessage = await bot.telegram.sendMessage(chatId, chunk, { parse_mode: 'HTML' });
          }
          else {
            if (advcontrols) sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId, parse_mode: 'HTML', reply_markup: { inline_keyboard: keyboard.inline_keyboard, resize_keyboard: true } });
            else sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId, parse_mode: 'HTML' });
          }

          if (autoDelHistory) {
            previousMessageIdIndex = !themeId ? String(userId) + String(chatId) + foundPlayer.server + foundPlayer.name + searchFor : String(userId) + String(chatId) + String(themeId) + foundPlayer.server + foundPlayer.name + searchFor;
            previousMessageId = messageIds[previousMessageIdIndex];
          }

          if (autodelhistory == 1 && previousMessageId) {
            try {
              if (!themeId) await bot.telegram.deleteMessage(chatId, previousMessageId);
              else await bot.telegram.deleteMessage(chatId, previousMessageId, { message_thread_id: themeId });
            } catch (error) {
              console.log('Не удалось удалить предыдущее сообщение:', error);
            }
          }

          // Сохраняем ID нового сообщения
          if (autodelhistory == 1) messageIds[foundPlayer.server + foundPlayer.name] = sentMessage.message_id;
          wasFinded = true;

        }
        catch (error) { console.log(`Ошибка: `, error) };
        messageCount++;
        //  Проверка ограничения на сообщения в секунду
        if (messageCount >= messagesPerSecond) {

          console.log(`Пауза на ${config.SLEEP_TIME} секунд`);
          if (!themeId) await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`);
          else await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`, { message_thread_id: themeId });
          await sleep(config.SLEEP_TIME);
          //setTimeout(sendNextMessage, pauseInterval);

          messageCount = 0;
        }
        messageCountAll++;
        if (messageCountAll >= config.MAX_MESSAGES_PER_SEARCH) {
          try {
            if (!themeId) return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.");
            else return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.", { message_thread_id: themeId });
          } catch (error) { console.log(`Ошибка: `, error) };
        }
      }
    };
    if (msgIdToDel && msgIdToDel != undefined && msgIdToDel != 0) {// && autodelhistory == 1) {
      try {
        if (!themeId) await bot.telegram.deleteMessage(chatId, msgIdToDel);
        else await bot.telegram.deleteMessage(chatId, msgIdToDel, { message_thread_id: themeId });
      } catch (error) {
        //console.log('Не удалось удалить предыдущее сообщение:', error);
      }
    }
    if (!skipStatusMsg && !wasFinded && canPostNotFinded) {
      if (!themeId) await bot.telegram.sendMessage(chatId, `Игрока ${searchFor} не найдено на серверах в игре <b>${gameName}</b>`, { parse_mode: 'HTML' });
      else await bot.telegram.sendMessage(chatId, `Игрока ${searchFor} не найдено на серверах в игре <b>${gameName}</b>`, { message_thread_id: themeId, parse_mode: 'HTML' });
    }
  } catch (error) { console.log(`Ошибка: `, error) };
  return wasFinded;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function checkMap(mapsArray, mapToCheck) {
  // Приводим строку mapToCheck к нижнему регистру
  mapToCheck = mapToCheck.toLowerCase();

  // Проходим по массиву mapsArray
  for (let i = 0; i < mapsArray.length; i++) {
    let map = mapsArray[i].toLowerCase();

    // Проверяем, есть ли в mapToCheck подстрока, соответствующая map
    if (
      // Проверяем, совпадает ли mapToCheck с map, игнорируя звездочки в map
      (map.startsWith('*') && map.endsWith('*') && mapToCheck.includes(map.slice(1, -1))) ||
      // Проверяем, начинается ли mapToCheck с map, игнорируя звездочку в начале map
      (map.startsWith('*') && mapToCheck.endsWith(map.slice(1))) ||
      // Проверяем, заканчивается ли mapToCheck map, игнорируя звездочку в конце map
      (map.endsWith('*') && mapToCheck.startsWith(map.slice(0, -1))) ||
      // Проверяем, совпадает ли mapToCheck с map полностью
      (mapToCheck === map)
    ) {
      return mapToCheck; // Возвращаем mapToCheck, если соответствие найдено
    }
  }

  // Если соответствие не найдено, возвращаем null
  return false;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function formatTimeDiff(ms) {
  const totalSec = Math.floor(ms / 1000);
  const min = Math.floor(totalSec / 60);
  const sec = totalSec % 60;
  return `${min}:${sec.toString().padStart(2, '0')}`;
}

function isActiveScore(score) {
  if (typeof score === 'string') {
    const s = score.trim().toLowerCase();
    if (s === 'spectator' || s === 'spec') return false;
  }
  const n = parseInt(score);
  if (isNaN(n)) return false;
  // активным считаем только не-нулевой числовой счёт
  return n !== 0;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function refreshServers(userId, serverToSearch, mapsToSearch, forceAllServersSearch, game, shortReport, msgIdToDel, skipStatusMsg, forceUpdate, anyToFind) {
  let wasFinded = false;
  try {
    log('serverToSearch=', serverToSearch);
    const userSettings = await getUserSettings(userId);
    const botSettings = await getUserSettings(0);
    let userServers;
    if (typeof serverToSearch === 'undefined') {
      serverToSearch = ''; // Установите значение по умолчанию, если searchFor не указан
    }

    if (typeof mapsToSearch === 'undefined') {
      mapsToSearch = []; // Установите значение по умолчанию, если mapsToSearch не указан
    }

    let canPostNotFinded = true;
    if ((serverToSearch == undefined || serverToSearch == '') && ((serverToSearch == undefined || mapsToSearch.length == 0))) canPostNotFinded = false;

    if (typeof forceAllServersSearch === 'undefined') {
      forceAllServersSearch = false; // Установите значение по умолчанию, если forceAllServersSearch не указан
    }

    if (typeof game === 'undefined') {
      game = config.DEFAULT_GAME; // Установите значение по умолчанию, если game не указан
    }

    if (typeof shortReport === 'undefined') {
      shortReport = false; // Установите значение по умолчанию, если shortReport не указан
    }

    if (typeof msgIdToDel === 'undefined') {
      msgIdToDel = '0'; // Установите значение по умолчанию, если msgIdToDel не указан
    }

    if (typeof skipStatusMsg === 'undefined') {
      skipStatusMsg = false; // Установите значение по умолчанию, если skipStatusMsg не указан
    }

    if (typeof forceUpdate === 'undefined') {
      forceUpdate = false; // Установите значение по умолчанию, если forceUpdate не указан
    }

    if (typeof anyToFind === 'undefined') {
      anyToFind = ''; // Установите значение по умолчанию, если forceUpdate не указан
    }

    anyToFind = String(anyToFind).trim();

    serverToSearch = serverToSearch.trim();
    //mapsToSearch = mapsToSearch.trim();

    if (game == 'q2') userServers = !userSettings || userSettings === undefined || userSettings.q2servers === undefined ? [] : userSettings.q2servers;
    else if (game == 'qw') userServers = !userSettings || userSettings === undefined || userSettings.qwservers === undefined ? [] : userSettings.qwservers;

    if (mapsToSearch.length == 0) { //если не передавали карту(ы) в параметре, смотрим есть ли в настройках
      if (game == 'q2') mapsToSearch = userSettings.q2maps || [];
      else if (game == 'qw') mapsToSearch = userSettings.qwmaps || [];
    }

    if (mapsToSearch.length == 0 || mapsToSearch[0] == '') mapsToSearch[0] = '*';
    //console.log('mapsToSearch=' + mapsToSearch.join(','));

    if (game == 'q2' && serverToSearch === '' && mapsToSearch.length == 0 && userServers.length == 0) {
      const ctx = userContexts[userId];
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Для включения возможности обновления данных о серверах вначале внесите настройки через команду /addserverq2.\nВ случае, если вам требуется только поиск по игрокам, вы можете пользоваться командами /rp и /sp');
      return;
    }
    else if (game == 'qw' && serverToSearch === '' && mapsToSearch.length == 0 && userServers.length == 0) {
      const ctx = userContexts[userId];
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Для включения возможности обновления данных о серверах вначале внесите настройки через команду /addserverq2.\nВ случае, если вам требуется только поиск по игрокам, вы можете пользоваться командами /rp и /sp');
      return;
    }

    let servers;

    if (serverToSearch != '') {
      servers = [];
      servers[0] = serverToSearch;
    } else {
      servers = userServers;
    }

    if ((mapsToSearch.length > 0 && servers.length == 0) || forceAllServersSearch) { //если ищем карты по всем серверам
      // if (game == 'q2') servers = await getServerListQ2();
      // else if (game == 'qw') servers = await getServerListQW();
      //if (serverToSearch == '') servers = await getServerList(game);
      //else servers = await getServerListFromCache(game);
      servers = await getServerListFromCache(game);
    }

    // Берём снимок кэша серверов для текущей игры на момент старта поиска
    const cacheSnapshot = (typeof globalServerCache !== 'undefined' && globalServerCache[game])
      ? globalServerCache[game]
      : null;

    console.log(
      'refreshServers: game=', game,
      ', servers.length=', servers.length,
      ', cacheSnapshot size=',
      cacheSnapshot ? Object.keys(cacheSnapshot).length : 0
    );

    //console.log('servers list:', servers);


    //console.log('searchFor=' + servers.join(', '));

    const chatId = userSettings ? userSettings.chatId : null; // Получаем chatId из настроек пользователя
    const themeId = userSettings ? userSettings.themeId : null; // Получаем themeId из настроек пользователя
    //const chatIdThemes = chatId.split('/');
    log('userId=' + userId + ', chatId=' + chatId);
    //console.log('chatId = ' + userSettings.chatId);

    const isBanned = userSettings && userSettings.banned && userSettings.banned != undefined ? userSettings.banned : false;
    if (isBanned !== false) {
      if (!themeId) return await bot.telegram.sendMessage(chatId, 'Вы забанены для поиска серверов.');
      else return await bot.telegram.sendMessage(chatId, 'Вы забанены для поиска пользователей.', { message_thread_id: themeId });
    }

    if (!chatId) {
      console.log('chatId не найден для пользователя ', userId);
      return;
    }

    if (serverToSearch === '' && (!servers || servers.length === 0)) {
      //console.log(`У пользователя ${userId} нет добавленных серверов.`);
      return; //bot.telegram.sendMessage(chatId, 'У вас нет добавленных серверов для обновления информации.\nДобавьте сервер(а) через комнаду /addserverq2 или используйте разовый поиск серверов по команде /ssq2.\nЕсли вы хотите обновить поиск только для игроков, пользуйтесь командой /rp или /sp для разового поиска игрока.\nВы также можете воспользоваться командой /smq2 для поиска серверов с интересующими вас картами.\nВоспользуйтесь командой /help для полного руководства по пользованию ботом.');
    }

    //const advmode = userSettings.advmode || 0;
    const advmode = userSettings && userSettings.advmode != undefined ? userSettings.advmode : 0;
    const altview = userSettings && userSettings.altview && userSettings.altview != undefined ? userSettings.altview : 0;
    //const minPlayers = userSettings.minPlayers || 1;
    //const botFilter = userSettings.botFilter || 1;
    let minPlayers = userSettings && userSettings.minPlayers != undefined ? userSettings.minPlayers : 1;
    const heuristic = userSettings && userSettings.heuristic && userSettings.heuristic != undefined ? userSettings.heuristic : 0;
    let botFilter = userSettings && userSettings.botFilter != undefined ? userSettings.botFilter : 1;
    const botFilterPlayers = botSettings && botSettings.botFilter != undefined ? botSettings.botFilter : [];
    //console.log('minPlayers=' + minPlayers + ', botFilter=' + botFilter);
    const serverList = servers;
    const foundServers = [];
    const foundPlayers = [];
    let serverInfoString = "";
    let foundPlayer = "";
    let playersInfoString = "";
    let serverPlayersTmp;
    //console.log('Анализ информации, полученной из серверов...');
    const promises = serverList.map(async (server) => {
      //console.log('Server: '+server);
      const [ip, port] = server.split(':');
      try {
        //const { players: serverPlayers, serverInfo } = await queryServerQ2(ip, port);
        let serverPlayers;
        let serverInfo;
        //queryServer
        /*
        if (serverToSearch == '') {
          ({ serverPlayers, serverInfo } = await queryServer(game, ip, port));
        }
        else {
          ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));
        }
        */
        // 29.11.2025 ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));

        // 👇 сначала пытаемся взять данные из глобального кэша (снимок на момент старта функции),
        // если записи нет — делаем живой запрос, как раньше.
        const cacheKey = `${ip}:${port}`;
        const cacheEntry = cacheSnapshot ? cacheSnapshot[cacheKey] : null;

        if (!cacheEntry) {
          log('refreshServers: cache MISS for', cacheKey);
        } else {
          log('refreshServers: cache HIT for', cacheKey);
        }

        if (cacheEntry) {
          serverPlayers = Array.isArray(cacheEntry.serverPlayers) ? cacheEntry.serverPlayers : [];
          serverInfo = cacheEntry.serverInfo || {};
          log('данные по серверам получены из кэша');
        } else {
          ({ serverPlayers, serverInfo } = await queryServerDirect(game, ip, port));
          log('данные по серверам получены напрямую');
        }

        /*
        if (game == 'q2') {
          ({ players: serverPlayers, serverInfo } = await queryServerQ2(ip, port));
        } else if (game == 'qw') {
          ({ players: serverPlayers, serverInfo } = await queryServerQW(ip, port));
        }
        */
        //console.log(serverPlayers);
        // 29.11.2025 serverPlayersTmp = serverPlayers.map(item => ({ ...item }));

        // Подтягиваем предыдущие данные по игрокам (в т.ч. timeOnMap), если они были
        const previousPlayersScoresRaw =
          heuristicHistoryPlayersScores[userId + server] && heuristicHistoryPlayersScores[userId + server] != undefined
            ? heuristicHistoryPlayersScores[userId + server]
            : [];

        const previousPlayersSnapshot = Array.isArray(previousPlayersScoresRaw)
          ? previousPlayersScoresRaw.map(item => ({ ...item }))
          : [];

        // Словарь: имя -> прошлый timeOnMap
        const previousTimeOnMapByName = new Map();
        for (const p of previousPlayersSnapshot) {
          if (p && typeof p.name === 'string' && p.timeOnMap !== undefined) {
            previousTimeOnMapByName.set(p.name, p.timeOnMap);
          }
        }

        // Копируем игроков с сервера и подтягиваем им прошлый timeOnMap (если был)
        serverPlayersTmp = serverPlayers.map(item => {
          const copy = { ...item };
          const prevTime = previousTimeOnMapByName.get(copy.name);
          if (prevTime !== undefined) {
            copy.timeOnMap = prevTime;
          }
          return copy;
        });


        if (advmode > 1 && serverInfoString === '') {  // если расширенный режим = 2 или 3 то включаем доп инфу о сервере
          for (const key in serverInfo) {
            serverInfoString += `${key}: ${serverInfo[key]}, `;
          }

          // Удаление последнего лишнего пробела и запятой
          serverInfoString = '\n\nИНФОРМАЦИЯ О СЕРВЕРЕ:\n' + normalNameHard(serverInfoString.slice(0, -2));

          //console.log('serverInfoString='+serverInfoString);
        }

        if (advmode === 1 || advmode === 3) playersInfoString = '\n\nИНФОРМАЦИЯ ОБ ИГРОКАХ:\n';

        //console.log(`serverInfo['mapname'] = ${serverInfo['mapname']}`);

        let serverPlayersToFilterCount = 0;
        let mapInclude;
        const mapname = serverInfo['mapname'] ? serverInfo['mapname'] : "";
        mapInclude = mapsToSearch[0] == '*' ? true : checkMap(mapsToSearch, mapname);//mapToSearch != '' && serverInfo['mapname'] && (mapToSearch.toLowerCase() !== serverInfo['mapname'].trim().toLowerCase()) ? false : true;
        //log('server' + server + 'mapInclude:', mapInclude);
        const canAnyToFind = anyToFind == '' ? true : serverPlayers.some(player => escapeHtmlForTelegram(player.name.toLowerCase().trim()).includes(escapeHtmlForTelegram(anyToFind.toLowerCase().trim()))) || Object.values(serverInfo).some(value => escapeHtmlForTelegram(value.toLowerCase().trim()).includes(escapeHtmlForTelegram(anyToFind.toLowerCase().trim())));
        if (anyToFind != '') {
          botFilter = 0;
          minPlayers = 0;
          serverInfoString = '';
          for (const key in serverInfo) {
            serverInfoString += `${key}: ${serverInfo[key]}, `;
          }
        }
        if (canAnyToFind && mapInclude) {
          //console.log('containsTargetString');
          //console.log('anyToFind='+anyToFind);
          let heuristicCanAddServer = true;
          let previousPlayersScores = {};
          let canScoreDiffVisual = true;
          let newMatch = false;

          if (heuristic == 1 && shortReport != true) {
            const previousScores = heuristicHistoryScores[userId + server] && heuristicHistoryScores[userId + server] != undefined ? heuristicHistoryScores[userId + server] : 0;
            const previousPlayers = heuristicHistoryPlayers[userId + server] && heuristicHistoryPlayers[userId + server] != undefined ? heuristicHistoryPlayers[userId + server] : [];
            const previousMap = heuristicHistoryMaps[userId + server] && heuristicHistoryMaps[userId + server] != undefined ? heuristicHistoryMaps[userId + server] : '';

            previousPlayersScores = heuristicHistoryPlayersScores[userId + server] && heuristicHistoryPlayersScores[userId + server] != undefined ? heuristicHistoryPlayersScores[userId + server].map(item => ({ ...item })) : [];
            let scoresSum = 0;
            let playersSum = '';

            //log('serverPlayersTmp.length:', serverPlayersTmp.length);
            //log('serverPlayers.length:', serverPlayers.length);
            heuristicHistoryPlayersScores[userId + server] = serverPlayersTmp;

            for (i = 0; i < serverPlayersTmp.length; i++) {
              try {
                let ss = parseInt(serverPlayersTmp[i].score);
                if (isNaN(ss)) ss = 0;
                scoresSum += ss;
              }
              catch (error) { log(error) };
              try {
                playersSum += normalName(serverPlayersTmp[i].name);
              }
              catch (error) { log(error) };

            }

            //log('scoresSum:', scoresSum);
            //log('playersSum:', playersSum);

            const sptl = serverPlayersTmp && serverPlayersTmp.length && serverPlayersTmp.length > 0 ? serverPlayersTmp.length : 1;
            //if (previousScores == 0) { //пока оставим эвристику работать только если эвристика запускается первый раз или у в эвристике зафиксировано, что у всех игроков 0 фрагов 
            if (!forceUpdate && previousMap == mapname && (previousScores == scoresSum && previousPlayers == playersSum)) {
              heuristicCanAddServer = false;

            }
            //log('mapname=' + mapname + ', previousMap=' + previousMap + ', previousScores=' + previousScores + ', previousPlayers=' + previousPlayers);
            //}

            if (!forceUpdate && serverPlayersTmp.length > 0) { //обновляем только если на сервере есть игроки (TD: учесть для QW спектаторов (score=Spectator))
              heuristicHistoryScores[userId + server] = scoresSum;
              heuristicHistoryPlayers[userId + server] = playersSum;
              heuristicHistoryMaps[userId + server] = mapname;
              //log('Текущие настройки эвристики сохранены.');
              //heuristicHistoryPlayersScores[userId + server] = serverPlayersTmp;
            }

            log('previousScores=' + previousScores + ', scoresSum=' + scoresSum + ', 3 * sptl=' + 3 * sptl);
            if (((previousScores - scoresSum) > 5 * sptl) || (previousMap != mapname)) {
              canScoreDiffVisual = false;
              if (scoresSum < 15 && serverPlayersTmp.length > 1) newMatch = true;
            }

            //log('heuristicCanAddServer=', heuristicCanAddServer);

          }

          if (heuristicCanAddServer) {
            //console.log(`mapToSearch=${mapToSearch}, serverInfo['mapname']=${serverInfo['mapname'].trim().toLowerCase()}, mapInclude=${mapInclude}`);
            //serverPlayersTmp.sort((a, b) => b.score - a.score); //сортируем по счёту
            serverPlayersTmp.sort((a, b) => {
              // Сначала сравниваем, если оба score - числа
              if (!isNaN(a.score) && !isNaN(b.score)) {
                return parseInt(b.score, 10) - parseInt(a.score, 10); // Сортировка по убыванию чисел
              } else if (!isNaN(a.score) && isNaN(b.score)) {
                return -1; // Число больше, чем Spectator
              } else if (isNaN(a.score) && !isNaN(b.score)) {
                return 1; // Spectator меньше, чем число
              } else {
                return 0; // Оба Spectator - не сравниваем
              }
            });

            //serverPlayersTmp.sort((a, b) => b.score - a.score); //сортируем по счёту
            //console.log(serverPlayersTmp);

            if (newMatch) {
              playersInfoString = `\n\n ---------- Новый матч ----------` + playersInfoString;
              const matchStartTs = Date.now();
              serverPlayersTmp.forEach(player => {
                // Если игрок уже реально играет (счёт не 0 и не Spectator) — стартуем таймер
                if (isActiveScore(player.score)) {
                  player.timeOnMap = matchStartTs;
                } else {
                  // спектатор / «спящий» игрок — время не считаем
                  delete player.timeOnMap;
                }
              });
            }

            serverPlayersTmp.forEach(player => {
              if (advmode === 1 || advmode === 3) {  // если расширенный режим = 1 или 3 то включаем доп инфу об игроках
                let scoreDiff = 0;
                let scoreDiffVisual = '';
                if (heuristic != 0 && canScoreDiffVisual) {
                  //log('previousPlayersScores.length=', previousPlayersScores.length);
                  for (i = 0; i < previousPlayersScores.length; i++) {
                    const pps = previousPlayersScores[i];
                    //log('pps=', pps);
                    if (pps.name == player.name) {
                      const prevScoreNum = parseInt(pps.score);
                      const curScoreNum = parseInt(player.score);

                      const safePrev = isNaN(prevScoreNum) ? 0 : prevScoreNum;
                      const safeCur = isNaN(curScoreNum) ? 0 : curScoreNum;

                      scoreDiff = safeCur - safePrev;

                      // ⚡ Игрок был без времени и начал активно играть:
                      //   - раньше считался "неактивным" (0 / Spectator),
                      //   - сейчас активный (score != 0 и не Spectator),
                      //   - и есть реальное изменение счёта
                      if (player.timeOnMap === undefined && isActiveScore(player.score) && scoreDiff !== 0) {
                        // считаем, что вошёл в игру примерно 10 секунд назад
                        player.timeOnMap = Date.now() - 10000;
                      }

                      if (scoreDiff < 0 && ((safeCur != 0) || (safeCur == 0 && scoreDiff >= -3))) { // ловим выход в спеки
                        scoreDiffVisual = ' 🔻' + scoreDiff.toString();
                      } else if (scoreDiff > 0) {
                        scoreDiffVisual = ' ⬆ +' + scoreDiff.toString();
                      }

                      if (player.timeOnMap !== undefined) {
                        const elapsed = Date.now() - player.timeOnMap;
                        const timeFormatted = formatTimeDiff(elapsed);
                        scoreDiffVisual = ` ⏱️ ${timeFormatted}` + scoreDiffVisual;
                      }

                      break;
                    }


                  }
                }
                if (altview == 0) {
                  playersInfoString += `\n <a href='https://www.gametracker.com/player/${normalNameHard(player.name).trim()}/${serverInfo['serverIp'] + ":" + serverInfo['serverPort']}/'>🔍</a> ${normalNameHard(player.name)}`;//`\n ${normalNameHard(player.name)}`;
                  playersInfoString += `\n Счёт: ${player.score}${scoreDiffVisual}`;
                  playersInfoString += `\n Пинг: ${player.ping}`;
                  playersInfoString += `\n -------------------`;
                }
                else {
                  //log('player=',player);
                  playersInfoString += `\n ${formatScore(player.score, 7)} | ${normalName(player.name)} [${player.ping}] ${scoreDiffVisual}`;
                }
              }
              if (botFilter == 1) {
                foundPlayer = includesPlayer(botFilterPlayers, normalNameHard(player.name));
                //console.log('foundPlayer=' + foundPlayer + ', player.name=' + player.name);
                if (foundPlayer && foundPlayer.trim() != '') serverPlayersToFilterCount++;
              }

            });

            //log('playersInfoString=', playersInfoString);

            //console.log('serverPlayers.length=' + serverPlayers.length);

            if (minPlayers == 0 || (minPlayers <= (serverPlayers.length - serverPlayersToFilterCount))) {
              //console.log("add server");
              foundServers.push({
                server: normalNameHard(server),
                serverIPPort: normalNameHard(serverInfo['serverIp'] + ":" + serverInfo['serverPort']),
                host: normalNameHard(serverInfo['hostname']),
                map: serverInfo['mapname'] && serverInfo['mapname'] != undefined ? serverInfo['mapname'] : 'нет (Not supported/QTV/GTV/Specs room)',
                playersList: serverPlayers.map(player => player.name).join(', '),
                serverInfo: serverInfoString,
                playersInfo: playersInfoString
              });
            }
          }
          else {
            log('Пропуск по эвристике:', server);
          }
        }

      } catch (error) {
        log(`Ошибка при запросе к серверу ${server}:`, error);
      }
    });

    // Ждем, пока все промисы завершатся
    await Promise.allSettled(promises);

    if (foundServers.length === 0) {
      //return bot.telegram.sendMessage(chatId, 'Игроки не найдены.');
    }

    let servers2;// = userSettings && userSettings.q2servers ? userSettings.q2servers : [];
    let keyboard;
    let advcontrols = userSettings && userSettings.advcontrols && userSettings.advcontrols != undefined ? userSettings.advcontrols : 0;
    let autodelhistory = userSettings && userSettings.autodelhistory && userSettings.autodelhistory != undefined ? userSettings.autodelhistory : 0;
    let messageCount = 0;
    let messageCountAll = 0;
    const messagesPerSecond = config.MAX_MESSAGES_PER_SECOND;

    let serversAddCDF = ''; let serversDelCDF = ''; let serversUpdateCDF = ''; serversSearchMapCDF = ''; //для указания Callback функции-обработчика кнопох телеги
    let gameName;
    if (game == 'q2') {
      //console.log('game - q2');
      servers2 = userSettings && userSettings.q2servers ? userSettings.q2servers : [];
      serversAddCDF = 'addserverq2_';
      serversDelCDF = 'delserverq2_';
      serversUpdateCDF = 'updateserverq2_';
      serversSearchMapCDF = 'searchmapq2_';
      gameName = 'Quake II';
    }
    else if (game == 'qw') {
      //console.log('game - qw');
      servers2 = userSettings && userSettings.qwservers ? userSettings.qwservers : [];
      serversAddCDF = 'addserverqw_';
      serversDelCDF = 'delserverqw_';
      serversUpdateCDF = 'updateserverqw_';
      serversSearchMapCDF = 'sesearchmapqw_';
      gameName = 'QuakeWorld';
    }
    log('Старт подготовки рассылки по найденным серверам.');
    let message;
    if (shortReport) {
      message = `Отчёт по серверам игры: <b>${gameName}</b>
<b>Ограничения для поиска:</b>   
Минимальное количество игроков на сервере: ${minPlayers}
Фильтрация ботов: ${botFilter == true ? 'включено, фильтруются: ' + botFilterPlayers.join(', ') : 'выключено'}.
Список карт для поиска: ${mapsToSearch.join(', ')}.
*************************

`;
    }

    //log('foundServers.length=', foundServers.length);

    //foundServers.forEach(async (foundServer) => {
    for (curIdx = 0; curIdx < foundServers.length; curIdx++) {

      let foundServer = foundServers[curIdx];
      //log('foundServers[' + curIdx + ']=' + foundServer.host);

      const q2ServerURL = `${foundServer.server}`; //<a href='https://www.gametracker.com/server_info/${foundServer.server}/'>${foundServer.server}</a>
      const gameTrackerURL = `<a href='https://www.gametracker.com/server_info/${foundServer.serverIPPort}/'>GameTracker</a>`;
      const shortServerInfo = `<a href='https://www.gametracker.com/server_info/${foundServer.serverIPPort}/'>🔍</a>`;
      let q2ServersURL;
      if (game == 'q2') {
        //q2ServersURL = `<a href='http://q2servers.com/?mod=*&g=*&m=*&c=ru&ac=*&s=pd&player=${foundPlayer.name}&action=Search'>q2servers</a>`;
      }
      else if (game == 'qw') {
        //q2ServersURL = ``;
      }


      let foundServer2 = includesServer(servers2, foundServer.server);
      foundServer2 = foundServer2 === '' ? includesServer(servers2, foundServer.serverIPPort) : foundServer2;
      //console.log('foundServer2=' + foundServer2 + ', foundServer.serverIPPort=' + foundServer.serverIPPort + 'foundServer.server=' + foundServer.server);

      if (advcontrols && !shortReport) {
        keyboard = {
          inline_keyboard: [
            [
              // { text: `Скопировать IP, url: 'https://t.me/share/url?url=${foundPlayer.server}'`},
              { text: `Обновить сервер`, callback_data: `${serversUpdateCDF}${foundServer.server}` },
            ]
          ]
        };

        if (foundServer2 && foundServer2.trim() != '') {
          keyboard.inline_keyboard[0].push({ text: `Не отслеживать сервер`, callback_data: `${serversDelCDF}${foundServer2}` });
        } else {
          keyboard.inline_keyboard[0].push({ text: `Отслеживать сервер`, callback_data: `${serversAddCDF}${foundServer.server}` });
        }

        let mapInlineKeyboard = [];
        mapInlineKeyboard.push({ text: `Найти все матчи на карте ${foundServer.map}`, callback_data: `${serversSearchMapCDF}${foundServer.map}` });
        keyboard.inline_keyboard.push(mapInlineKeyboard);

      }

      const messagesPerSecond = config.MAX_MESSAGES_PER_SECOND;
      let sentMessage;
      let previousMessageId;
      let previousMessageIdIndex;
      if (!shortReport) {
        if (autodelhistory == 1) {
          previousMessageIdIndex = !themeId ? String(userId) + String(chatId) + foundServer.server + mapsToSearch.join('') + serverToSearch : String(userId) + String(chatId) + String(themeId) + foundServer.server + mapsToSearch.join('') + serverToSearch;
          previousMessageId = messageIds[previousMessageIdIndex];
        }
        if (altview == 0) {
          message = `Обновление для сервера ${shortServerInfo} ${q2ServerURL}
Игра: <b>${gameName}</b>
Название: ${foundServer.host}
Карта: ${foundServer.map}
Игроки: ${normalNameHard(foundServer.playersList)}
Ссылки: ${gameTrackerURL}${foundServer.serverInfo + foundServer.playersInfo}`;
        }
        else {
          message = `Информация по серверу ${shortServerInfo} ${q2ServerURL} в игре <b>${gameName}</b>
Название: ${foundServer.host}
Карта: ${foundServer.map}
Игроки: ${normalNameHard(foundServer.playersList)}${foundServer.serverInfo + foundServer.playersInfo}`;
        }
        const chunks = message.match(/(.|[\n\r]){1,4096}/g);
        //log(foundServer.host + ', message:\n', message);
        if (autoDelHistory) {
          //if (!themeId) await deleteBotMessagesInTopic(chatId);
          //else await deleteBotMessagesInTopic(chatId, themeId);
        }

        // Удаляем старое сообщение
        if (autodelhistory == 1 && previousMessageId) {
          log('themeId=' + themeId + ', previousMessageId=' + previousMessageId);
          try {
            if (!themeId) await bot.telegram.deleteMessage(chatId, previousMessageId);
            else await bot.telegram.deleteMessage(chatId, previousMessageId, { message_thread_id: themeId });
          } catch (error) {
            console.log('Не удалось удалить предыдущее сообщение:', error);
          }
        }

        for (const chunk of chunks) {

          try {
            log('themeId=', themeId);
            if (!themeId) {
              if (advcontrols) sentMessage = await bot.telegram.sendMessage(chatId, chunk, { parse_mode: 'HTML', reply_markup: keyboard });
              else sentMessage = await bot.telegram.sendMessage(chatId, chunk, { parse_mode: 'HTML' });
            }
            else {
              log('refreshServers -> sentMessage: chatId=' + chatId + 'themeId=' + themeId);
              if (advcontrols) sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId, parse_mode: 'HTML', reply_markup: keyboard });
              else sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId, parse_mode: 'HTML' });
            }

            if (autodelhistory == 1) messageIds[previousMessageIdIndex] = sentMessage.message_id;

          } catch (error) { console.log(`Ошибка: ${error.message}`, error) };
          messageCount++;
          //  Проверка ограничения на сообщения в секунду
          if (messageCount >= messagesPerSecond) {
            console.log(`Пауза на ${config.SLEEP_TIME} секунд`);
            if (!themeId) {
              await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`);
            }
            else {
              await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`, { message_thread_id: themeId });
            }
            await sleep(config.SLEEP_TIME);
            messageCount = 0;
          }
          wasFinded = true;
          messageCountAll++;
          if (messageCountAll >= config.MAX_MESSAGES_PER_SEARCH) {
            try {
              if (!themeId) return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.");
              else return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.", { message_thread_id: themeId });
            } catch (error) { console.log(`Ошибка: ${error.message}`, error) };
          }
        }
      }
      else {
        //message += `${shortServerInfo} ${q2ServerURL}
        message += `${q2ServerURL}
Название: ${foundServer.host} 
Карта: ${foundServer.map}
Игроки: ${normalNameHard(foundServer.playersList)}
${anyToFind != '' ? 'Информация о сервере: ' + escapeHtmlForTelegram(foundServer.serverInfo) : ''}

`;
      }

      //log('!!!!! END CURRENT SERVER:', curIdx);

    };

    if (shortReport) {
      /* пока убираю - надо подумать как лучше хранить для shortReport, поскольку foundServer тут не годится - цикл выше заканчивается по foundServer
     if (autodelhistory == 1) {
       previousMessageIdIndex = !themeId ? 'ShortReport' + game + String(userId) + foundServer.server + mapsToSearch.join('') + serverToSearch : 'ShortReport' + game + String(userId) + String(themeId) + foundServer.server + mapsToSearch.join('') + serverToSearch;
       previousMessageId = messageIds[previousMessageIdIndex];
     }
       */
      messageCount = 0;
      //console.log(message);
      const chunks = message.match(/(.|[\n\r]){1,4096}/g);
      for (const chunk of chunks) {
        // console.log(chunk);
        try {
          log('themeId=', themeId);
          if (!themeId) sentMessage = await bot.telegram.sendMessage(chatId, chunk, { parse_mode: 'HTML' });
          else {
            log('refreshServers -> sentMessage: chatId=' + chatId + 'themeId=' + themeId);
            sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId, parse_mode: 'HTML' });
          }
          wasFinded = true;
          /*
          // Сохраняем ID нового сообщения
          if (autodelhistory == 1 && previousMessageId) {
            try {
              if (!themeId) await bot.telegram.deleteMessage(chatId, previousMessageId);
              else bot.telegram.deleteMessage(chatId, previousMessageId, { message_thread_id: themeId });
            } catch (error) {
              console.log('Не удалось удалить предыдущее сообщение:', error);
            }
          }
          if (autodelhistory == 1) messageIds[previousMessageIdIndex] = sentMessage.message_id;
          */
        } catch (error) { console.log(`Ошибка: ${error.message}`, error) };
        messageCount++;
        //  Проверка ограничения на сообщения в секунду
        if (messageCount >= messagesPerSecond) {
          console.log(`Пауза на ${config.SLEEP_TIME} секунд`);
          if (!themeId) await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`);
          else await bot.telegram.sendMessage(chatId, `Слишком много информации, пожалуйста скорректируйте информацию, которую вы хотите найти.\nПродолжение рассылки найденной информации через ${config.SLEEP_TIME / 1000} секунд(ы)...`, { message_thread_id: themeId });
          await sleep(config.SLEEP_TIME);
          messageCount = 0;
        }

        messageCountAll++;
        if (messageCountAll >= config.MAX_MESSAGES_PER_SEARCH) {
          try {
            if (!themeId) return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.");
            else return await bot.telegram.sendMessage(chatId, "Превышено количество сообщений в рамках текущего поиска, пожалуйста скорректируйте информацию, которую вы хотите найти.", { message_thread_id: themeId });
          } catch (error) { console.log(`Ошибка: ${error.message}`, error) };
        }
      }
    }




    if (msgIdToDel && msgIdToDel != undefined && msgIdToDel != 0) {
      try {
        if (!themeId) await bot.telegram.deleteMessage(chatId, msgIdToDel);
        else await bot.telegram.deleteMessage(chatId, msgIdToDel, { message_thread_id: themeId });
      } catch (error) {
        //console.log('Не удалось удалить предыдущее сообщение:', error);
      }
    }

    log('skipStatusMsg=' + skipStatusMsg + ', wasFinded=' + wasFinded + ',canPostNotFinded=' + canPostNotFinded);
    if (!skipStatusMsg && !wasFinded && canPostNotFinded) {
      if (!themeId) await bot.telegram.sendMessage(chatId, `Игроков не найдено на сервере ${serverToSearch} в игре <b>${gameName}</b> или сработали фильтры (/mp , /botfilter).`, { parse_mode: 'HTML' });
      else await bot.telegram.sendMessage(chatId, `Игроков не найдено на сервере ${serverToSearch} в игре <b>${gameName}</b> или сработали фильтры (/mp , /botfilter).`, { message_thread_id: themeId, parse_mode: 'HTML' });
    }

  } catch (error) { console.log(`Ошибка: `, error) };
  return wasFinded;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function escapeHtmlForTelegram(text) {
  // Заменяем все кавычки-елочки на кавычки-апострофы
  text = text.replace(/"/g, "'");

  // Заменяем все амперсанды на &amp;
  text = text.replace(/&/g, '&amp;');

  // Заменяем все угловые скобки на соответствующие символы HTML-сущностей
  text = text.replace(/</g, '&lt;').replace(/>/g, '&gt;');

  return text;
}

function formatScore(score) {
  try {
    const scoreString = score.toString();
    if (scoreString.match(/^\d+$/)) {
      // Если строка содержит только цифры
      const paddingCount = Math.max(0, 4 - scoreString.length);
      const paddedScore = scoreString.padStart(paddingCount, ' '); // Используем paddingCount
      return paddedScore;
    } else {
      // Если строка не содержит только цифры
      return scoreString;
    }
  } catch (error) { return score; }
}

function formatScoreOld(score, num) {
  const scoreString = score.toString();
  const paddedScore = scoreString.padStart(num, ' '); // Добавляем пробелы в начало
  return paddedScore;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function sleep(ms) {
  return new Promise(resolve => setTimeout(resolve, ms));
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function refreshPlayersAllGames(userId, searchFor, msgId, skipStatusMsg, forceUpdate) {
  let wasFinded = false;
  try {
    if (typeof msgId === 'undefined') {
      msgId = 0;
    }
    if (typeof skipStatusMsg === 'undefined') {
      skipStatusMsg = 0;
    }
    if (typeof forceUpdate === 'undefined') {
      msforceUpdateId = false;
    }
    const userSettings = await getUserSettings(userId);
    const games = !userSettings || userSettings === undefined || userSettings.games === undefined || userSettings.games.join().trim() == '' ? [] : userSettings.games;
    //console.log('games=' + games.join(', ') + ', msgId='+msgId);
    for (i = 0; i < games.length; i++) {
      //console.log('1 - go to refreshPlayers: user=' + userId + ', game=' + games[i] + ', games.length=' + games.length);
      const res = refreshPlayers(userId, searchFor, games[i], msgId, skipStatusMsg, forceUpdate); //не менять на await refreshPlayers - виснет бот!
      if (res == true) wasFinded = true;
    };
  } catch (error) { console.log(`Ошибка: `, error) };
  return wasFinded;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function refreshServersAllGames(userId, msgId) {
  try {
    if (typeof msgId === 'undefined') {
      msgId = 0;
    }
    const userSettings = await getUserSettings(userId);
    const games = !userSettings || userSettings === undefined || userSettings.games === undefined || userSettings.games.join('').trim() == '' ? [] : userSettings.games;

    //console.log('games=' + games.join(', '));
    for (i = 0; i < games.length; i++) {
      //console.log('2 - go to refreshServers: user=' + userId + ', game=' + games[i]);

      if ((userSettings.q2servers && userSettings.q2servers != undefined && userSettings.q2servers.join("").trim() != '')
        || (userSettings.q2maps && userSettings.q2maps != undefined && userSettings.q2maps.join("").trim() != '')
        && games[i] == 'q2'
      ) {
        refreshServers(userId, '', '', false, 'q2', false, msgId); //не ставить await для refreshServers - виснет бот!
      }
      else if ((userSettings.qwservers && userSettings.qwservers != undefined && userSettings.qwservers.join("").trim() != '')
        || (userSettings.qwmaps && userSettings.qwmaps != undefined && userSettings.qwmaps.join("").trim() != '')
        && games[i] == 'qw'
      ) {
        refreshServers(userId, '', '', false, 'qw', false, msgId); //не ставить await для refreshServers - виснет бот!
      }
    };

  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция поиска игроков на серверах . В случае, если указан параметр searchFor функция ищет игрока по значению, указанному в этом параметре.
async function refresh(userId, searchFor, msgId) {
  try {
    //console.log('refresh -> userId: ' + userId + ',searchFor:', searchFor);

    const userSettings = await getUserSettings(userId);
    if (!userSettings || userSettings === undefined || (
      (!userSettings.games || userSettings.games == undefined || userSettings.games.join("").trim() === '')
      && (!userSettings.players || userSettings.players == undefined || userSettings.players.join("").trim() === '')
    )) {
      log('refresh - нет настроек для мониторинга игроков');
    }
    else await refreshPlayersAllGames(userId, searchFor, msgId);

    if (!userSettings || userSettings === undefined || (
      (userSettings.games === undefined || userSettings.games.join("").trim() === '')
      && (userSettings.q2servers === undefined || userSettings.q2servers.join("").trim() === '')
      && (userSettings.qwservers === undefined || userSettings.qwservers.join("").trim() === '')
      && (userSettings.q2maps === undefined || userSettings.q2maps.join("").trim() === '')
      && (userSettings.qwmaps === undefined || userSettings.qwmaps.join("").trim() === '')
    )) {
      log('refresh - нет настроек для мониторинга серверов');
    }
    else {
      await refreshServersAllGames(userId, msgId);
    }
  } catch (error) { console.log(`Ошибка: `, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

bot.on('callback_query', async (ctx) => {
  //console.log('query.message.chat='+ctx.message.chat.id);
  try {
    const data = ctx.callbackQuery.data;
    console.log('data=' + data);
    if (data.startsWith('updatePlayer_')) {
      const gamePlayer = data.substring('updatePlayer_'.length).split('<<<<gameplayer>>>>');
      let game = gamePlayer[0];
      let playerName = gamePlayer[1];
      let userId = await getUserID(ctx); //ctx.callbackQuery.message.chat.id
      //if (playerName.includes(' ')) playerName = `"*${playerName}*"`; //добавляем кавычки по краям имени если есть пробелы в имени
      console.log('playerName=', playerName);
      // Вызовите функцию для обновления информации об игроке
      //await refreshPlayersAllGames(ctx.callbackQuery.message.chat.id, playerName, '0', true, true, game);
      log('ctx.callbackQuery.message.chat.id=', ctx.callbackQuery.message.chat.id);
      await refreshPlayers(userId, playerName, game, '0', true, true);
    }
    else if (data.startsWith('addPlayer_')) {
      let playerName = [];
      playerName[0] = data.substring('addPlayer_'.length);
      console.log('callback_query - playerName=' + playerName[0]);
      await addPlayers(ctx, playerName, 'players');
    }
    else if (data.startsWith('delPlayer_')) {
      //let playerName = [];
      const playerName = [];
      playerName[0] = data.substring('delPlayer_'.length);
      console.log('playerName=' + playerName[0]);
      await delPlayers(ctx, playerName, 'players');
    }
    else if (data.startsWith('addSPFilter_')) {
      let sp = data.substring('addSPFilter_'.length);
      let spArr = sp.split('\\');
      //console.log('callback_query - playerName=' + playerName[0]);
      await addPlayers(ctx, spArr, 'spfilter');
    }
    else if (data.startsWith('updateserverq2_')) {
      const server = data.substring('updateserverq2_'.length);
      const allMaps = []; allMaps[0] = '*';
      let userId = getUserID(ctx); //ctx.callbackQuery.message.chat.id
      await refreshServers(userId, server, allMaps, false, 'q2', false, '0', true, true);
    }
    else if (data.startsWith('updateserverqw_')) {
      const server = data.substring('updateserverqw_'.length);
      const allMaps = []; allMaps[0] = '*';
      await refreshServers(ctx.callbackQuery.message.chat.id, server, allMaps, false, 'qw', false, '0', true, true);
    }
    else if (data.startsWith('addserverq2_')) {
      let server = [];
      server[0] = data.substring('addserverq2_'.length);
      //console.log('server=' + server[0]);
      await addServers(ctx, server, 'q2');
    }
    else if (data.startsWith('delserverq2_')) {
      //let playerName = [];
      const server = data.substring('delserverq2_'.length);
      //console.log('server=' + server);
      await delServer(ctx, server, 'q2');
    }
    else if (data.startsWith('addserverqw_')) {
      let server = [];
      server[0] = data.substring('addserverqw_'.length);
      console.log('serverqw=' + server[0]);
      await addServers(ctx, server, 'qw');
    }
    else if (data.startsWith('delserverqw_')) {
      //let playerName = [];
      const server = data.substring('delserverqw_'.length);
      console.log('serverqw=' + server);
      await delServer(ctx, server, 'qw');
    }
    else if (data.startsWith('searchmapq2_')) {
      //let playerName = [];
      const map = [];
      map[0] = data.substring('searchmapq2_'.length);
      console.log('map=' + map[0]);
      const userId = getUserID(ctx);
      await refreshServers(userId, '', map, true, 'q2');
    }
    else if (data.startsWith('sesearchmapqw_')) {
      //let playerName = [];
      const map = [];
      map[0] = data.substring('sesearchmapqw_'.length);
      console.log('map=' + map[0]);
      const userId = getUserID(ctx);
      await refreshServers(userId, '', map, true, 'qw');
    }

  } catch (error) { console.log('Ошибка:', error); }
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function formatName(input) {
  // Проверяем, есть ли пробелы в строке
  if (input.includes(' ')) {
    // Убираем пробелы из начала и конца строки
    let trimmedInput = input.trim();

    // Проверяем, оформлена ли строка в кавычках
    if (!trimmedInput.startsWith('"') && !trimmedInput.endsWith('"')) {
      // Если нет, добавляем кавычки по краям
      return `"${trimmedInput}"`;
    } else if (!trimmedInput.startsWith('"')) {
      // Если нет первой кавычки, добавляем её
      return `"${trimmedInput}`;
    } else if (!trimmedInput.endsWith('"')) {
      // Если нет последней кавычки, добавляем её
      return `${trimmedInput}"`;
    } else {
      // Если строка уже оформлена в кавычках, возвращаем её как есть
      return trimmedInput;
    }
  }

  // Если пробелов нет, возвращаем строку как есть
  return input;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function normalName(input) { // Функция служит для удаления плохих символов - например, с имён игроков
  return escapeHtmlForTelegram(input);
  let normal = input.replace("'", "");
  return normal;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function normalNameHard(input) { // Функция служит для удаления плохих символов - например, с имён игроков
  if (!input || input == undefined || input.trim() == '') return '';

  return escapeHtmlForTelegram(input);

  let normal = input;
  normal = normal.replace(/[\'\n]/g, '');
  normal = normal.replace('<', '&lt');
  normal = normal.replace('>', '&gt');
  normal = normal.replace('\'', '&apos;');

  if (normal.trim() == '') return '';
  return normal;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function includesPlayer(playerArray, searchString) {
  searchString = searchString.toLowerCase(); // Делаем поиск нечувствительным к регистру
  if (!playerArray || playerArray == undefined || playerArray.length == '') return '';
  for (let i = 0; i < playerArray.length; i++) {
    let player = normalName(playerArray[i].toLowerCase()); // Делаем поиск нечувствительным к регистру

    if (player.startsWith('*') && player.endsWith('*')) { // Поиск по подстроке
      if (searchString.includes(player.slice(1, -1))) {
        return player; // Возвращаем найденный элемент, если подстрока найдена
      }
    } else if (player.startsWith('*')) { // Поиск по окончанию строки
      if (searchString.endsWith(player.slice(1))) {
        return player; // Возвращаем найденный элемент, если строка заканчивается на искомую подстроку
      }
    } else if (player.endsWith('*')) { // Поиск по началу строки
      if (searchString.startsWith(player.slice(0, -1))) {
        return player; // Возвращаем найденный элемент, если строка начинается на искомую подстроку
      }
    } else { // Поиск по точному совпадению
      if (player === searchString) {
        return player; // Возвращаем найденный элемент, если строка точно совпадает
      }
    }
  }

  return ''; // Если элемент не найден, возвращаем пустую строку
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function includesServer(serverArray, searchString) {
  try {
    searchString = searchString.toLowerCase().trim(); // Делаем поиск нечувствительным к регистру
    //console.log(serverArray);
    //console.log('searchString = ' + searchString);
    for (let i = 0; i < serverArray.length; i++) {
      let server = serverArray[i].toLowerCase().trim(); // Делаем поиск нечувствительным к регистру
      //console.log("server=" + server);
      if (server === searchString) {
        log("fineded!");
        return server; // Возвращаем найденный элемент, если строка точно совпадает
      }
    }
  } catch (error) { console.log(`Ошибка: `, error) };

  return ''; // Если элемент не найден, возвращаем пустую строку
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function refreshCommand(ctx) { //функция для принудительного обновления всего, что в настройках
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const userSettings = await getUserSettings(userId);
    if (!userSettings || userSettings === undefined || (
      (userSettings.players === undefined || userSettings.players.join("").trim() === '')
      && (userSettings.q2servers === undefined || userSettings.q2servers.join("").trim() === '')
      && (userSettings.qwservers === undefined || userSettings.qwservers.join("").trim() === '')
      && (userSettings.q2maps === undefined || userSettings.q2maps.join("").trim() === '')
      && (userSettings.qwmaps === undefined || userSettings.qwmaps.join("").trim() === '')
    )) {
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Вначале внесите настройки для поиска (/addplayer , /addserverq2).');
      return await ctx.reply('Вначале внесите настройки для поиска (/addplayer , /addserverq2).');
    }
    console.log('Старт поиска игроков');

    let msgId = 0;
    await ctx.reply('Старт поиска игроков.\nПри наличии информации, вы получите новые сообщения с результатами поиска.').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);

    });
    await refresh(userId, '', msgId);
    //const msgId = await ctx.reply('Старт поиска игроков и серверов.\nПри наличии информации, вы получите новые сообщения с результатами поиска.');
    //await refresh(userId, '', msgId);
  } catch (error) { console.log(`Ошибка:`, error) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для принудительного обновления всего, что в настройках
bot.command('refresh', async (ctx) => {
  try {
    await refreshCommand(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

bot.command('r', async (ctx) => {
  try {
    await refreshCommand(ctx);
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для принудительного обновления только игроков
bot.command('rp', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const userSettings = await getUserSettings(userId);
    if (!userSettings || userSettings === undefined || userSettings.players === undefined || userSettings.players.join("").trim() === '') {
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Вначале внесите настройки для поиска (/addplayer).');
      return await ctx.reply('Вначале внесите настройки для поиска (/addplayer).');
    }
    console.log('Старт поиска игроков и серверов');
    let msgId = 0;
    await ctx.reply('Старт поиска игроков.\nПри наличии информации, вы получите новые сообщения с результатами поиска.').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);
    });
    await refreshPlayersAllGames(userId, '', msgId);

    //const msgId = await ctx.reply('Старт поиска игроков.\nПри наличии информации, вы получите новые сообщения с результатами поиска.');
    //await refreshPlayersAllGames(userId, msgId);

  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для принудительного обновления только серверов
bot.command('rs', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const userSettings = await getUserSettings(userId);
    if (!userSettings || userSettings === undefined || userSettings.q2servers === undefined || userSettings.q2servers.join("").trim() === '') {
      //return await bot.telegram.sendMessage(ctx.chat.id, 'Вначале внесите настройки для поиска (/addserverq2).');
      return ctx.reply('Вначале внесите настройки для поиска (/addserverq2).');
    }
    /* -дописать потом
    let server = "";
    const serverId = ctx.message.text.split(' ')[1];
    if (serverId && serverId != undefined && serverId.trim() != "" && )
   */

    console.log('Старт поиска серверов');

    let msgId = 0;
    await ctx.reply('Старт поиска серверов.\nПри наличии информации, вы получите новые сообщения с результатами поиска.').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);
    });
    await refreshServersAllGames(userId, msgId);
    //await ctx.reply('Старт поиска серверов.\nПри наличии информации, вы получите новые сообщения с результатами поиска.');
    //await refreshServers(userId);
    //await refreshServersAllGames(userId, );
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска игрока 
bot.command('sp', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;

    // Получаем имя игрока с учетом пробелов в кавычках или без них
    let sp = ctx.message.text.match(/"([^"]*)"/);
    if (sp) { // Если в кавычках
      sp = sp[1]; // Берем текст в кавычках
    } else { // Если без кавычек
      sp = ctx.message.text.split(' ')[1]; // Берем второй элемент
    }

    if (!isValidPlayerName(sp)) {
      return ctx.reply(`Имя игрока должно состоять из минимум ${config.PLAYERS_NICK_NAME_LIMIT} символа(ов).  + Если используется маска, то минимум ${config.PLAYERS_NICK_NAME_MASK_LIMIT} символа(ов) + одна или две звездочки.`);
    }
    //console.log('Старт поиска игроков');
    //const msgId = await ctx.reply('Старт поиска игроков');
    let msgId = 0;
    await ctx.reply('Старт поиска игроков').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);
    });
    let wasFinded = await refreshPlayersAllGames(userId, sp, msgId, false, true);

    //await refreshPlayersAllGames(userId, sp, msgId);

  }
  catch (error) { console.log('Ошибка:', error.message); };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function searchServer(ctx, game, msg) { //Функция для поиска сервера
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const ss = ctx.message.text.split(' ')[1];

    if (!isValidServer(ss)) {
      return ctx.reply(msg);
    }

    //await ctx.reply('Старт поиска серверов');

    //const userSettings = await getUserSettings(userId);
    //let wasFinded = false; let searchResult;
    let msgId = 0;
    await ctx.reply('Старт поиска серверов').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);
    });

    const allMaps = []; allMaps[0] = '*';
    console.log('Старт поиска серверов');
    await refreshServers(userId, ss, allMaps, false, game, false, msgId, false, true);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска сервера Q2
bot.command('ssq2', async (ctx) => {
  try {
    await searchServer(ctx, 'q2', `Адрес сервера должнен быть указан в виде IPAddress:Port или Domen:Port, например, 212.42.38.88:27910 или q2.playground.ru:27910`);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска сервера QW
bot.command('ssqw', async (ctx) => {
  try {
    await searchServer(ctx, 'qw', `Адрес сервера должнен быть указан в виде IPAddress:Port или Domen:Port, например, 35.185.44.174:27500 или qw.playground.ru:27500`);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function searchMap(ctx, game, msg) { //Функция для поиска карты
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const sm = ctx.message.text.split(' ');
    sm.shift();
    if (!sm || sm.join().trim() == '') {
      return ctx.reply(msg);
    }
    let msgId = 0;
    await ctx.reply('Старт поиска карты на серверах...').then((message) => {
      msgId = message.message_id;
      console.log('msgId:', msgId);
    });
    refreshServers(userId, '', sm, true, game, false, msgId, false, true);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/


// Команда для разового поиска карты Q2
bot.command('smq2', async (ctx) => {
  try {
    await searchMap(ctx, 'q2', `Введите имя карт(ы), например: /smq2 q2dm1 *rdm* *q2duel*`);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска карты QW
bot.command('smqw', async (ctx) => {
  try {
    await searchMap(ctx, 'qw', `Введите имя карт(ы), например: /smqw e1* *dm* *duel*`);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function searchInfo(ctx, game, msg) { //Функция для вызова отчета поиска серверов
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;

    let sm = ctx.message.text.split(' ');
    sm.shift();
    if (!sm || sm.join().trim() == '') {
      sm = [];
      sm[0] = '*';
    }

    let msgId = 0;
    await ctx.reply(msg).then((message) => {
      msgId = message.message_id;
      //console.log('msgId:', msgId);
    });
    refreshServers(userId, '', sm, true, game, true, msgId);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
}


// Команда для разового поиска серверов Q2 с наличием игроков.
bot.command('siq2', async (ctx) => {
  try {
    await searchInfo(ctx, 'q2', 'Старт поиска серверов Quake II ...');
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска серверов QW с наличием игроков.
bot.command('siqw', async (ctx) => {
  try {
    await searchInfo(ctx, 'qw', 'Старт поиска серверов QuakeWorld ...');
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function findInfo(ctx, game, msg) { //Функция для вызова отчета поиска серверов
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;

    let fi = ctx.message.text.split(' ');
    fi.shift();
    if (!fi || fi.join().trim() == '') {
      //fi = [];
      //fi[0] = '*';
      let txt = '';
      if (game == 'q2') txt = '/fq2 playground';
      else if (game == 'qw') txt = '/fqw bot';
      await ctx.reply('Укажите, что вы хотите найти через пробел после ввода команды, например: ' + txt);
      return;
    }

    if (String(fi[0]).trim().length < config.FIND_TEXT_LIMIT) {
      await ctx.reply('минимальное количество символов для поиска информации: ' + config.FIND_TEXT_LIMIT);
      return;
    }

    let msgId = 0;
    await ctx.reply(msg).then((message) => {
      msgId = message.message_id;
      //console.log('msgId:', msgId);
    });
    refreshServers(userId, '', ['*'], true, game, true, msgId, false, true, fi[0]);
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
}


// Команда для разового поиска серверов Q2 с наличием игроков.
bot.command('fq2', async (ctx) => {
  try {
    await findInfo(ctx, 'q2', 'Старт поиска поиска информации в Quake II ...');
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового поиска серверов QW с наличием игроков.
bot.command('fqw', async (ctx) => {
  try {
    await findInfo(ctx, 'qw', 'Старт поиска информации в QuakeWorld ...');
  }
  catch (error) { console.log(`Ошибка: ${error.message}`) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function stats(userId, ctx, game, displayMsg, shortStats) {
  try {

    if (typeof ctx === 'undefined' || !ctx || ctx == undefined) {
      //ctx = userContexts[userId];
    }
    else {
      userId = getUserID(ctx);
      userContexts[userId] = ctx;
    }

    if (typeof displayMsg === 'undefined' || displayMsg == undefined) {
      displayMsg = true;
    }

    if (typeof shortStats === 'undefined' || shortStats == undefined) {
      shortStats = false;
    }

    const userSettings = await getUserSettings(userId);
    let themeId = userSettings ? userSettings.themeId : null; // Получаем themeId из настроек пользователя
    const chatId = userSettings ? userSettings.chatId : null; // Получаем chatId из настроек пользователя
    let autodelhistory = userSettings && userSettings.autodelhistory && userSettings.autodelhistory != undefined ? userSettings.autodelhistory : 0;

    let msgId = 0;
    if (displayMsg) {
      await ctx.reply(`Старт сбора статистики в игре ${config.GAMES_TITLES[game]}...`).then((message) => {
        msgId = message.message_id;
        //console.log('msgId:', msgId);
      });
    }

    let statsRes = await GetServersStats(game);
    let statsMsg = `✍ Статистика по игре ${config.GAMES_TITLES[game]}:

🗄️ Количество серверов: ${statsRes.serverCount}

🕵️ Количество игроков: ${statsRes.playersCount}

🛣️ Количество карт:  ${statsRes.mapsCount}

〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎
${!shortStats ? '\n🏝️ Карты:\n' + statsRes.uniqueMaps
        + '\n\n〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎\n' : ''}
${!shortStats ? '\n🕹️ Режимы:\n' + statsRes.uniqueMatchTypes
        + '\n\n〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎〰︎\n\n' : ''}⛹ Игроки:
${statsRes.uniquePlayers}
${!shortStats ? '\n\n🏋 Топ-5 игроков по фрагам' + statsRes.top5Players : ''}
`;
    let previousMessageId;
    let sentMessage;
    if (autodelhistory == 1) {
      if (!themeId) previousMessageId = messageIds['stats' + game + String(chatId)];
      else previousMessageId = messageIds['stats' + game + String(chatId) + String(themeId)];
    }
    if (msgId) {
      try {
        await bot.telegram.deleteMessage(userId, msgId);
      } catch (error) { };
    }
    let chunks = statsMsg.match(/(.|[\n\r]){1,4096}/g);
    for (const chunk of chunks) {
      if (ctx) {
        sentMessage = await ctx.reply(chunk);
        if (autodelhistory == 1) messageIds['stats' + game + String(chatId)] = sentMessage.message_id;
      }
      else if (!themeId) {
        sentMessage = await bot.telegram.sendMessage(chatId, chunk);
        if (autodelhistory == 1) messageIds[stats + game + chatId] = sentMessage.message_id;
      }
      else {
        sentMessage = await bot.telegram.sendMessage(chatId, chunk, { message_thread_id: themeId });
        if (autodelhistory == 1) messageIds['stats' + game + String(chatId) + String(themeId)] = sentMessage.message_id;
      }
    }
    //sentMessage.message_id

    log('stats -> autodelhistory' + autodelhistory + ', previousMessageId=' + previousMessageId + ', chatId=' + chatId + ', themeId=' + themeId);
    if (autodelhistory && previousMessageId) {
      if (!themeId) await bot.telegram.deleteMessage(chatId, previousMessageId);
      else await bot.telegram.deleteMessage(chatId, previousMessageId, { message_thread_id: themeId });
    }

  }
  catch (error) { console.log(`Ошибка: `, error) };
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function statsSetup(ctx, game) { //вспомогательная функция для установки altview
  try {

    const userId = getUserID(ctx);
    userContexts[userId] = ctx; // Сохраняем контекст пользователя

    let statsMonitoring = parseInt(ctx.message.text.split(' ')[1]);
    let userSettings;

    if (game == 'q2') {

      if (isNaN(statsMonitoring) || statsMonitoring < 0 || (statsMonitoring > 1)) {
        userSettings = await getUserSettings(userId);
        statsMonitoring = userSettings && userSettings.sq2m != undefined ? userSettings.sq2m : 0;
        return ctx.reply('Укажите корректное значение параметра:\n0 - мониторинг статистики серверов ' + game + ' выключен\n1 - включён.\n\nТекущее значение: ' + statsMonitoring);
      }
      await updateUserSettings(userId, { sq2m: statsMonitoring });
      userSettings = await getUserSettings(userId);
      statsMonitoring = userSettings.sq2m;
    }
    else if (game == 'qw') {

      if (isNaN(statsMonitoring) || statsMonitoring < 0 || (statsMonitoring > 1)) {
        userSettings = await getUserSettings(userId);
        statsMonitoring = userSettings && userSettings.sqwm != undefined ? userSettings.sqwm : 0;
        return ctx.reply('Укажите корректное значение параметра:\n0 - мониторинг статистики серверов ' + game + ' выключен\n1 - включён.\n\nТекущее значение: ' + statsMonitoring);
      }
      await updateUserSettings(userId, { sqwm: statsMonitoring });
      userSettings = await getUserSettings(userId);
      statsMonitoring = userSettings.sqwm;
    }

    if (statsMonitoring > 0) {
      return ctx.reply('Мониторинг статистики серверов ' + game + ': ВКЛЮЧЕН.');
    } else {
      return ctx.reply('Мониторинг статистики серверов ' + game + ': ВЫКЛЮЧЕН.');
    }



  } catch (error) { console.log(`Ошибка: `, error); }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для установки статистики серверов q2 для мониторинга
bot.command('sq2m', async (ctx) => {
  try {
    await statsSetup(ctx, 'q2');
  } catch (error) { console.log(`Ошибка:`, error) };
});

// Команда для установки статистики серверов qw для мониторинга
bot.command('sqwm', async (ctx) => {
  try {
    await statsSetup(ctx, 'qw');
  } catch (error) { console.log(`Ошибка:`, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Команда для разового вызова статистики по серверам.
bot.command('stats', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    const userSettings = await getUserSettings(userId);
    const games = !userSettings || userSettings === undefined || userSettings.games === undefined || userSettings.games.join().trim() == '' ? [] : userSettings.games;
    //console.log('games=' + games.join(', ') + ', msgId='+msgId);
    if (games.length == 0) {
      await ctx.reply('Вначале установите игры командой /ag');
      return;
    }
    for (i = 0; i < games.length; i++) {
      //console.log('1 - go to refreshPlayers: user=' + userId + ', game=' + games[i] + ', games.length=' + games.length);
      await stats('', ctx, games[i], true);
    };
  }
  catch (error) { console.log(`Ошибка: `, error) };
});


// Команда для разового вызова статистики по серверам q2.
bot.command('sq2', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    await stats('', ctx, 'q2', true);
  }
  catch (error) { console.log(`Ошибка: `, error) };
});

// Команда для разового вызова статистики по серверам qw.
bot.command('sqw', async (ctx) => {
  try {
    const userId = getUserID(ctx);
    userContexts[userId] = ctx;
    await stats('', ctx, 'qw', true);
  }
  catch (error) { console.log(`Ошибка: `, error) };
});

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function GetServersStats(game) {
  try {
    const botSettings = await getUserSettings(0);
    const botFilterPlayers = botSettings && botSettings.botFilter != undefined ? botSettings.botFilter : [];
    if (botSettings && botSettings.allservers && botSettings.allservers[game]) {
      const servers = botSettings.allservers[game];

      const serverCount = servers.length;
      const uniqueMaps = new Set(); //список карт
      const uniqueMatchTypes = new Set();
      const uniquePlayers = new Set(); //список игроков
      const playersCount = 0;
      const mapsCount = 0;
      const allPlayers = [];

      servers.forEach(server => {
        uniqueMaps.add(server.mapname);
        uniqueMatchTypes.add(server.match_type);
        server.serverPlayers.forEach(player => {
          const foundPlayer = includesPlayer(botFilterPlayers, normalNameHard(player.name));
          if (foundPlayer == '') {
            uniquePlayers.add(player.name);
            allPlayers.push(player);
          }
        });
      });

      // Сортировка по возрастанию
      const sortedMaps = Array.from(uniqueMaps).sort();
      const sortedMatchTypes = Array.from(uniqueMatchTypes).sort();
      const sortedPlayers = Array.from(uniquePlayers).sort();
      // Сортировка игроков по очкам
      const sortedPlayersByScore = allPlayers.sort((a, b) => b.score - a.score).slice(0, 5); // Берём топ-5 игроков

      return {
        serverCount: serverCount,
        playersCount: uniquePlayers.size,
        mapsCount: uniqueMaps.size,
        uniqueMaps: sortedMaps.join(', '),
        uniqueMatchTypes: sortedMatchTypes.join(', '),
        uniquePlayers: sortedPlayers.join(', '),
        top5Players: sortedPlayersByScore.map((player, index) => `${index + 1}. ${player.name} (${player.score})`).join(', ') // Форматируем топ-5 игроков с цифрами
      };
    } else {
      return {
        serverCount: 0,
        playersCount: 0,
        mapsCount: 0,
        uniqueMaps: '',
        uniqueMatchTypes: '',
        uniquePlayers: '',
        top5Players: ''
      };
    }
  } catch (error) {
    console.log('GetServersStats error: ', error);
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/
function canDetailsLog() {
  try {
    if (config.PROD == 1) {
      return true;
    }
    else return false;
  } catch (error) {
    console.log(`Ошибка: ${error.message}`);
    return true;
  };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

function log(msg, msg2) {
  if (canDetailsLog()) {
    if (typeof msg2 === 'undefined') console.log(msg);
    else console.log(msg, msg2);
  }
}


// Функция для автообновления информации с серверов
async function initializeAutoServersUpdate() {
  try {
    const updateServersEnabled = true;
    const timerUpdate = config.SERVERS_UPDATE_TIMER;// 30;
    console.log('Старт автообновления серверов');
    if (updateServersEnabled) {
      await startAutoServersUpdate(timerUpdate); // Запускаем автообновление для пользователей с установленным таймером
    }

  } catch (error) {
    console.log(`Ошибка при инициализации автопоиска: `, error);
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для апдейта
async function startAutoServersUpdate(interval) {
  try {

    if (typeof interval === 'undefined') {
      interval = 30; // Установите значение по умолчанию, если таймер не указан
    }

    setInterval(async () => {

      const games = config.GAMES.split(',');
      let allServers = {
        q2: [],
        qw: []
      };
      //const botSettings = await getUserSettings(0);

      for (curGameIdx = 0; curGameIdx < games.length; curGameIdx++) {
        let serverList;
        let serverPlayers;
        let serverInfo;

        if (games[curGameIdx] == 'q2') {
          console.log('Старт автообновления серверов ', games[curGameIdx]);
          serverList = await getServerListQ2();
          const promises = serverList.map(async (server) => {
            const [ip, port] = server.split(':');
            ({ players: serverPlayers, serverInfo } = await queryServerQ2(ip, port));
            serverInfo.serverPlayers = serverPlayers;
            allServers.q2.push(serverInfo);
          });
          // Ждем, пока все промисы завершатся
          await Promise.allSettled(promises);
          console.log('allServers.length=', allServers.q2.length);
        }
        else if (games[curGameIdx] == 'qw') {
          console.log('Старт автообновления серверов ', games[curGameIdx]);
          serverList = await getServerListQW();
          const promises = serverList.map(async (server) => {
            const [ip, port] = server.split(':');
            ({ players: serverPlayers, serverInfo } = await queryServerQW(ip, port));
            serverInfo.serverPlayers = serverPlayers;
            allServers.qw.push(serverInfo);
          });
          // Ждем, пока все промисы завершатся
          await Promise.allSettled(promises);
          console.log('allServers.length=', allServers.qw.length);
        }

      }
      await updateUserSettings(0, { allservers: allServers });
      console.log('Данные по серверам и игрокам обновлены в БД');

    }, interval * 1000);
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function getServerList(game) {
  try {
    log('getServerList - game:', game);
    const botSettings = await getUserSettings(0);
    if (botSettings && botSettings.allservers && botSettings.allservers[game]) {
      return botSettings.allservers[game].map(server => `${server.serverIp}:${server.serverPort}`);
    } else {
      return [];
    }
  } catch (error) {
    log('getServerList:', error);
    return [];
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function getServerListFromCache(game) { //для получения серверов из кэша напрямую
  let servers = [];
  try {
    log('getServerListFromCache - game:', game);
    if (game == 'q2') servers = await getServerListQ2();
    else if (game == 'qw') servers = await getServerListQW();
  } catch (error) {
    console.log('getServerListFromCache:', error);
    return [];
  }
  return servers;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function queryServer(game, ip, port) {
  let serverPlayers;
  let serverInfo;
  try {
    //log('queryServer - game:', game);
    const botSettings = await getUserSettings(0);
    if (botSettings && botSettings.allservers && botSettings.allservers[game]) {
      const server = botSettings.allservers[game].find(server => {
        return server.serverIp === ip && server.serverPort === port;
      });
      if (server) {
        serverPlayers = server.serverPlayers;
        serverInfo = { ...server }; // Создаем копию, чтобы не изменять исходный объект
        delete serverInfo.serverPlayers; // Удаляем serverPlayers из serverInfo
        return { serverPlayers, serverInfo };
      } else {
        return { serverPlayers: [], serverInfo: {} }; // Возвращаем пустые объекты, если сервер не найден
      }
    } else {
      return { serverPlayers: [], serverInfo: {} }; // Возвращаем пустые объекты, если серверов нет
    }
  } catch (error) {
    log('getServerList:', error);
    return { serverPlayers: [], serverInfo: {} }; // Возвращаем пустые объекты, если серверов нет
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function queryServerDirect(game, ip, port) {
  let serverPlayers = [];
  let serverInfo = {};
  try {
    if (game == 'q2') {
      ({ players: serverPlayers, serverInfo } = await queryServerQ2(ip, port));
    } else if (game == 'qw') {
      ({ players: serverPlayers, serverInfo } = await queryServerQW(ip, port));
    }
    return { serverPlayers, serverInfo };

  } catch (error) {
    //log('getServerList:', error);
    return { serverPlayers: [], serverInfo: {} }; // Возвращаем пустые объекты, если серверов нет
  }
}

/* -------------------------------------------------------------...--------------------------------------------------------------*/

async function queryServerDirect(game, ip, port) {
  let serverPlayers = [];
  let serverInfo = {};
  try {
    if (game == 'q2') {
      ({ players: serverPlayers, serverInfo } = await queryServerQ2(ip, port));
    } else if (game == 'qw') {
      ({ players: serverPlayers, serverInfo } = await queryServerQW(ip, port));
    }
    return { serverPlayers, serverInfo };

  } catch (error) {
    log('getServerList:', error);
    return { serverPlayers: [], serverInfo: {} }; // Возвращаем пустые объекты, если серверов нет
  }
}

/* -------------------------------------------------------------...--------------------------------------------------------------*/
// 🔁 ГЛОБАЛЬНЫЙ ОПРОС СЕРВЕРОВ И ЗАПОЛНЕНИЕ КЭША В ПАМЯТИ БОТА

async function refreshGlobalServersCache() {
  if (isGlobalServerCacheRefreshing) {
    console.log('refreshGlobalServersCache: предыдущее обновление ещё не закончено, пропускаем тик');
    return;
  }

  isGlobalServerCacheRefreshing = true;

  try {
    console.log('refreshGlobalServersCache: старт обновления данных серверов');
    const games = config.GAMES ? config.GAMES.split(',') : ['q2', 'qw'];
    const now = new Date();

    // временный кэш, чтобы потом атомарно поменять ссылку
    const newCache = {
      q2: {},
      qw: {}
    };

    // получаем всех пользователей один раз
    let allUsers = [];
    try {
      allUsers = await getAllUsers();
    } catch (e) {
      console.log('refreshGlobalServersCache: не удалось получить список пользователей:', e);
    }

    for (let i = 0; i < games.length; i++) {
      const game = games[i].trim();
      if (!game) continue;

      // множество уникальных серверов для этой игры
      const uniqueServers = new Set();

      // 1) сервера из мастер-списка
      let serverList = [];
      if (game === 'q2') {
        serverList = await getServerListQ2();
      } else if (game === 'qw') {
        serverList = await getServerListQW();
      } else {
        continue;
      }

      if (Array.isArray(serverList)) {
        serverList.forEach((s) => {
          if (s && typeof s === 'string') {
            uniqueServers.add(s.trim());
          }
        });
      }

      // 2) сервера из настроек всех пользователей
      if (Array.isArray(allUsers) && allUsers.length > 0) {
        for (const user of allUsers) {
          try {
            // если getAllUsers уже возвращает полные настройки, можно будет упростить;
            // но надёжнее сейчас ещё раз получить настройки по userId
            const userId = user.userId !== undefined ? user.userId : null;
            if (userId === null || userId === undefined) continue;

            const userSettings = await getUserSettings(userId);
            if (!userSettings) continue;

            let userServers = [];
            if (game === 'q2') {
              userServers = userSettings.q2servers || [];
            } else if (game === 'qw') {
              userServers = userSettings.qwservers || [];
            }

            if (Array.isArray(userServers)) {
              userServers.forEach((s) => {
                if (s && typeof s === 'string') {
                  uniqueServers.add(s.trim());
                }
              });
            }
          } catch (e) {
            console.log('refreshGlobalServersCache: ошибка при разборе серверов пользователя', user, e);
          }
        }
      }

      const allServers = Array.from(uniqueServers);

      if (!Array.isArray(allServers) || allServers.length === 0) {
        console.log(`refreshGlobalServersCache: для игры ${game} список серверов пуст (master+users)`);
        continue;
      }

      console.log(
        `refreshGlobalServersCache: игра=${game}, серверов из master=${Array.isArray(serverList) ? serverList.length : 0}, ` +
        `всего уникальных (master+users)=${allServers.length}`
      );

      const promises = allServers.map(async (server) => {
        const [ip, port] = server.split(':');
        const key = `${ip}:${port}`;
        try {
          const { serverPlayers, serverInfo } = await queryServerDirect(game, ip, port);

          newCache[game][key] = {
            game,
            ip,
            port,
            server: key,
            serverInfo,
            serverPlayers,
            lastUpdated: now
          };
        } catch (err) {
          console.log(`refreshGlobalServersCache: ошибка сервера ${server} (${game})`, err);
          // при ошибке просто не добавляем этот сервер в новый снэпшот
        }
      });

      await Promise.allSettled(promises);
    }

    // 👇 атомарная замена ссылок на новый снэпшот
    globalServerCache.q2 = newCache.q2;
    globalServerCache.qw = newCache.qw;

    //console.log('refreshGlobalServersCache: глобальный кэш по серверам обновлён');
  } catch (error) {
    console.log('Ошибка при обновлении глобального кэша серверов:', error);
    // в случае ошибки старый globalServerCache остаётся доступным
  } finally {
    isGlobalServerCacheRefreshing = false;
  }
}


/* -------------------------------------------------------------...--------------------------------------------------------------*/

// Запуск периодического глобального опроса серверов
function startGlobalServerPolling() {
  try {
    const intervalSec = config.GLOBAL_REFRESH_INTERVAL || 10;
    if (intervalSec <= 0) {
      console.log('GLOBAL_REFRESH_INTERVAL <= 0, глобальный опрос серверов отключён');
      return;
    }

    const intervalMs = intervalSec * 1000;

    if (globalServerTimer) {
      clearTimeout(globalServerTimer);
      globalServerTimer = null;
    }

    console.log(`Глобальный опрос серверов запущен, интервал = ${intervalSec} сек`);

    const tick = async () => {
      await refreshGlobalServersCache();
      globalServerTimer = setTimeout(tick, intervalMs);
    };

    // первый запуск сразу
    tick();
  } catch (error) {
    console.log('Ошибка при запуске глобального опроса серверов:', error);
  }
}

function getServerFromGlobalCache(game, ip, port) {
  const gameCache = globalServerCache[game];
  if (!gameCache) return null;
  const key = `${ip}:${port}`;
  return gameCache[key] || null;
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/


// Функция для автоматического поиска игроков
async function startAutoSearch(userId, interval) {

  try {
    if (userTimers[userId]) {
      clearInterval(userTimers[userId]);
    }
    if (typeof interval === 'undefined') {
      interval = 30; // Установите значение по умолчанию, если таймер не указан
    }

    userTimers[userId] = setInterval(async () => {

      const userSettings = await getUserSettings(userId);
      if (userSettings && userSettings != undefined) {
        const sleepTime = userSettings.sleepTime; // Предполагается, что это строка в формате "HH:MM-HH:MM"
        const isBanned = userSettings && userSettings.banned && userSettings.banned != undefined ? userSettings.banned : false;
        const statsMonitoringQ2 = userSettings && userSettings.sq2m != undefined ? userSettings.sq2m : 0;
        const statsMonitoringQW = userSettings && userSettings.sqwm != undefined ? userSettings.sqwm : 0;
        if (isBanned !== false) {
          console.log('Пользователь заблокирован для автообновления: ' + userId);
          return;
        }

        const currentTime = new Date();

        if (isInSleepTime(currentTime, sleepTime)) {
          console.log('Время сна для пользователя ', userId);
          return; // Если текущий момент времени попадает в период сна, ничего не делаем
        }

        if (statsMonitoringQ2 > 0) await stats(userId, null, 'q2', false, true);
        if (statsMonitoringQW > 0) await stats(userId, null, 'qw', false, true);

        await refresh(userId);
      }
    }, interval * 1000);
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Функция для остановки автоматического поиска
async function stopAutoSearch(userId) {
  try {
    if (userTimers[userId]) {
      clearInterval(userTimers[userId]);
      delete userTimers[userId];
    }
  } catch (error) { console.log(`Ошибка: ${error.message}`) };
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/
// Функция для проверки, попадает ли текущее время в период сна
function isInSleepTime(currentTime, sleepTime) {
  try {
    if (!sleepTime) return false;

    const [startStr, endStr] = sleepTime.split('-');
    const [startHours, startMinutes] = startStr.split(':').map(Number);
    const [endHours, endMinutes] = endStr.split(':').map(Number);

    const start = new Date(currentTime.getFullYear(), currentTime.getMonth(), currentTime.getDate(), startHours, startMinutes);
    const end = new Date(currentTime.getFullYear(), currentTime.getMonth(), currentTime.getDate(), endHours, endMinutes);

    // Если конец интервала раньше начала, значит интервал пересекает полночь
    if (end < start) {
      // Проверяем, попадает ли текущее время в один из двух интервалов:
      // 1. От начала интервала до конца дня
      // 2. От начала дня до конца интервала
      return currentTime >= start || currentTime <= end;
    }

    // Обычный случай, когда интервал не пересекает полночь
    return currentTime >= start && currentTime <= end;
  } catch (error) {
    console.log(`Ошибка: ${error.message}`);
  }
}
/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/
// Функция для инициализации автообновлений для всех пользователей
async function initializeAutoSearch() {
  try {
    console.log('Старт автообновления для всех пользователей');
    const users = await getAllUsers(); // Получаем всех пользователей из базы данных
    for (const user of users) {
      const timerEnabledExists = (user.timerEnabled && user.timerEnabled != undefined && user.timerEnabled == 1) ? true : await checkCanTimer(user.userId);
      const monitoringEnabled = (user.timer && user.timer != undefined && user.timer > 0) && timerEnabledExists ? true : false;
      const userSettings = await getUserSettings(user.userId);
      const timerEnabled = userSettings && userSettings != undefined && userSettings.timerEnabled && userSettings.timerEnabled != undefined ? userSettings.timerEnabled : 0;
      if (monitoringEnabled && timerEnabled != 1) await updateUserSettings(user.userId, { timerEnabled: 1 });

      console.log('monitoringEnabled', user.userId + ' : ' + monitoringEnabled);
      //const isBanned = banCheck(user.userId);
      if (monitoringEnabled && await checkCanTimer(user.userId)) {
        console.log('Обновление для пользователя ', user.userId);
        await startAutoSearch(user.userId, user.timer); // Запускаем автообновление для пользователей с установленным таймером
      }
    }
  } catch (error) {
    console.log(`Ошибка при инициализации автопоиска: `, error);
  }
}

/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

async function deleteBotMessagesInTopic(chatId, messageThreadId) {
  try {

    if (typeof messageThreadId === 'undefined') {
      messageThreadId = null; // Установите значение по умолчанию
    }

    // Получаем список всех сообщений бота в теме
    if (messageThreadId) {
      const messages = await bot.telegram.getChatMessages(chatId, {
        message_thread_id: messageThreadId,
        from_id: botId, // ID бота (уже определено в глобальной области видимости)
      });

      // Удаляем все сообщения бота в теме
      for (const message of messages) {
        await bot.telegram.deleteMessage(chatId, message.message_id, {
          message_thread_id: messageThreadId,
        });
      }
    }
    else {
      const messages = await bot.telegram.getChatMessages(chatId, {
        from_id: botId, // ID бота (уже определено в глобальной области видимости)
      });

      // Удаляем все сообщения бота в теме
      for (const message of messages) {
        await bot.telegram.deleteMessage(chatId, message.message_id);
      }
    }

    log('Все сообщения бота в теме удалены');
  } catch (error) {
    log('Ошибка при удалении сообщений бота в теме:', error);
  }
}


/* --------------------------------------------------------------------------------------------------------------------------------------------------------*/

// Запуск бота
bot.launch()
  .then(() => {
    try {
      console.log('Бот запущен');
      //initializeAutoServersUpdate(); //Инициализируем обновление серверов
      console.log('Запуск глобального автоматического опроса серверов...');
      startGlobalServerPolling();    // 🔁 новый глобальный опрос серверов и заполнение кэша в памяти
      console.log('Запуск автоматического обновения поиска по данным пользователей...');
      initializeAutoSearch(); // Инициализация автообновлений
    }
    catch (error) { console.log('error:', error); }
  })
  .catch(err => console.log('Ошибка запуска бота:', err)
  );